{
  "metadata": {
    "totalProfiles": 57,
    "successfulExtractions": 57,
    "failedExtractions": 2,
    "extractedAt": "2025-11-19T19:41:33.414Z",
    "sourceDirectory": "/Users/victor/CascadeProjects/ocean-va/src/pages"
  },
  "profiles": [
    {
      "name": "ABIGAIL FAITH",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Abigail.webp",
      "summary": "Abigail Faith is a proactive and results-driven Executive Virtual Assistant with over 6 years of combined experience in customer service, virtual operations, and administrative support. She has supported U.S.-based teams in industries such as fitness, insurance, food delivery, and gaming. Consistently delivering exceptional service through clear communication, structured workflows, and efficient client management.",
      "tagline": "Abigail is a dependable virtual partner for business owners, coaches, and service providers seeking long-term support in client management, admin operations, and customer experience.",
      "videoUrl": "https://www.youtube.com/embed/z3hiwu0mPc8",
      "skills": [
        "Executive & Administrative Support",
        "Email & Calendar Management",
        "Process Improvement",
        "Client Onboarding",
        "Social Media Asset Creation",
        "SOP Documentation",
        "Lead Tracking",
        "Discovery Call Management"
      ],
      "tools": [
        "Salesforce",
        "Zoom Workspace",
        "Google Meet",
        "Google Workspace",
        "Asana",
        "Canva"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "OUTSOURCE PLUG",
          "position": "Executive Virtual Assistant",
          "period": "MAY 2023 - JUN 2025",
          "description": "Provided administrative and operational support to a fitness studio, handled lead tracking, scheduling, SOP documentation, and marketing content creation using tools like Canva."
        },
        {
          "company": "TASKUS",
          "position": "Executive Virtual Assistant",
          "period": "FEB 2022 - MAR 2023",
          "description": "Managed client communication, email correspondence, scheduling, and Salesforce CRM operations while delivering personalized client support via Zoom and Google Meet."
        },
        {
          "company": "TELETECH",
          "position": "Customer Care Representative (Seasonal Food Delivery Campaign)",
          "period": "AUG 2021 - JAN 2022",
          "description": "Handled virtual customer support for a food delivery service, resolving delivery issues and coordinating with partners to ensure smooth order fulfillment."
        },
        {
          "company": "INFOSYS",
          "position": "Customer Care Representative (Insurance Account)",
          "period": "APR 2021 - AUG 2021",
          "description": "Assisted customers with insurance-related inquiries including policy coverage, renewals, and claims, while managing account updates and virtual support needs."
        },
        {
          "company": "CONCENTRIX",
          "position": "Customer Care Representative (Gaming Account)",
          "period": "AUG 2017 - APR 2021",
          "description": "Managed high call volumes for a gaming account, resolved technical issues, and optimized reservation workflows in a fast-paced virtual environment."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "95",
      "englishDescription": "Communicates fluently and naturally with clear pronunciation and strong command of grammar. Uses a wide range of vocabulary and expressions to convey ideas accurately and confidently across various topics.",
      "education": {
        "school": "PAMANTASAN NG LUNGSOD NG PASIG",
        "degree": "BACHELOR",
        "date": "2011 - 2015"
      },
      "sourceFile": "AbigailProfile.jsx"
    },
    {
      "name": "ADRIAN",
      "title": "VIRTUAL ASSISTANT | INSURANCE SUPPORT SPECIALIST",
      "image": "/images/VAs/Adrian.webp",
      "summary": "Adrian is a highly adaptable Virtual Assistant with extensive experience in insurance operations, client communication, and bilingual interpretation. With a strong background in project management and customer service, Adrian has supported U.S.-based insurance firms, helping streamline operations and manage offices in Mexico for both client and internal operations.",
      "tagline": "Adrian is an ideal Virtual Assistant for insurance agencies, healthcare providers, and service-based businesses seeking a bilingual professional with proven experience in administrative support.",
      "videoUrl": "https://www.youtube.com/embed/k5OatPLSORw",
      "skills": [
        "High-Volume Inbound Calls",
        "Insurance Quoting",
        "Appointment Settings",
        "Project Management",
        "Insurance Customer Service & Sales",
        "Document Translation",
        "Client Relationship Management",
        "Medical & General Interpretation",
        "Policy Changes",
        "Cross-Selling",
        "Training & Team Supervision"
      ],
      "tools": [
        "CRM Systems",
        "Insurance Carrier Platforms",
        "Microsoft Office",
        "Google Workspace",
        "Telephony & Call Handling Systems",
        "EzyLinx"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "AMN HEALTHCARE",
          "position": "Virtual Medical Interpreter",
          "period": "OCT 2023 - AUG 2024",
          "description": "Provided accurate real-time medical interpretation for healthcare providers and patients in clinical settings."
        },
        {
          "company": "KELLY SERVICES / LANGUAGE LINE SOLUTIONS",
          "position": "Medical Interpreter",
          "period": "JAN 2023 - JUN 2023",
          "description": "Served as a medical interpreter for sensitive healthcare-related calls, ensuring accurate and confidential communication between patients and providers."
        },
        {
          "company": "WELCOME WAGON",
          "position": "Appointment Setter",
          "period": "AUG 2022 - DEC 2022",
          "description": "Worked as an appointment setter, using CRM tools and research to generate leads and book meetings for marketing and advertising services."
        },
        {
          "company": "ATLAS INSURANCE SERVICES",
          "position": "Project Manager",
          "period": "AUG 2021 - AUG 2022",
          "description": "Led the setup and operations of customer service and commercial insurance sales offices, supporting Auto, Home, and Life insurance processes for over 40 companies in Texas."
        },
        {
          "company": "SUMMER SCAPE",
          "position": "Sales",
          "period": "2021",
          "description": "Sold vacation packages for major resort destinations and later managed sales closings, staff training, and call monitoring."
        },
        {
          "company": "INSTITUTO DE IDIOMAS PLATINO",
          "position": "Public School Teacher",
          "period": "ONGOING",
          "description": "Taught English to students ranging from middle school to professionals, following structured curriculum."
        },
        {
          "company": "TELEPERFORMANCE - WESTERN UNION",
          "position": "Agent Support",
          "period": "2014 - 2015",
          "description": "Handled U.S.-based customer inquiries and agent support tasks, including error resolution and materials management."
        }
      ],
      "discResult": "C+S",
      "discResultDescription": "Conscientiousness (C) - Detail-oriented and organized, C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.\\n\\nSteadiness (S) - Dependable and patient, S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "85",
      "englishDescription": "Shows strong fluency and clear pronunciation, making speech easy to understand. Uses a wide range of vocabulary and grammar with confidence to express complex ideas effectively.",
      "education": {
        "school": "NORMAL SCHOOL OF HIGHER STUDIES CAMPUS SALTILLO",
        "degree": "SPECIALIZING IN THE ENGLISH LANGUAGE",
        "date": null
      },
      "sourceFile": "AdrianProfile.jsx"
    },
    {
      "name": "ALEJANDRO",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Alejandro.webp",
      "summary": "Alejandro is a bilingual Virtual Assistant with a solid foundation in insurance, business development, and operational support. With direct experience in customer retention, lead prospecting, and policy sales, he combines analytical thinking with people skills to drive results.",
      "tagline": "Alejandro brings a rare mix of sales acumen, operational insight, and bilingual fluency—making him a valuable VA for insurance firms, startups, and service providers.",
      "videoUrl": "https://www.youtube.com/embed/a_cRiGRSLEs",
      "skills": [
        "Policy Quoting",
        "Insurance Customer Service (Auto, Life, Property)",
        "Policy Changes",
        "Underwriting",
        "Email Campaigns & Outreach",
        "Cancellations",
        "Operational Support",
        "Claims Entry",
        "CRM & Lead Generation",
        "Report Building",
        "Quality Auditing"
      ],
      "tools": [
        "Turborater",
        "Freshworks",
        "InsurancePro",
        "Hubspot",
        "Slack",
        "Google Workspace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "LATAM PARTNERS",
          "position": "Operations Manager",
          "period": "JUL 2025 - 2025",
          "description": "• Ensured customer satisfaction by achieving an 80% positive rating through Google surveys.\\n• Structured a comprehensive workflow incorporating calls, voicemails, texts, and emails with follow-up to support account coordination.\\n• Held weekly check-ins with the leadership team.\\n• Delegated tasks equitably across the organization and coached staff to ensure consistent performance and task completion.\\n• Trained and coached staff to increase sales of life policies.\\n• Served as the main point of contact between carriers and first-time responders.\\n• Audited tasks, phone calls, emails, and texts to ensure quality and meet expectations based on a ranking system.\\n• Developed corporate handbook to ensure standardized workflows company-wide."
        },
        {
          "company": "GDI CONNECT",
          "position": "Business Development",
          "period": "DEC 2023 - APR 2025",
          "description": "• Prospected 1,000 companies monthly to generate new business opportunities, consistently securing 15-20 meetings per month.\\n• Executed approximately 100 calls, emails, SMS, and LinkedIn messages daily to engage potential clients.\\n• Designed and managed targeted email campaign sequences across various industries, including IT, Non-Profits, Government Agencies, Marketing, Mortgage, Healthcare, Construction, Accounting, Sales, HR, and Software Development.\\n• Developed a comprehensive sales funnel to effectively engage C-Level Executives, VPs, Directors, and Managers through multi-channel outreach (phone, SMS, LinkedIn, email).\\n• Delivered persuasive pitches to high-level decision-makers, enhancing client acquisition and relationship building."
        },
        {
          "company": "A-MAX AUTO INSURANCE",
          "position": "Insurance Agent",
          "period": "AUG 2022 - JUN 2023",
          "description": "• Prepared end-of-day (EOD) reports to ensure accurate accounts payable by reviewing receipts and vouchers.\\n• Maintained positive and effective communication with insurance providers to resolve payment discrepancies.\\n• Fostered positive relationships through in-person visits to allied agencies, securing referrals to generate additional business.\\n• Consistently achieved monthly sales goals, earning commissions and ensuring timely payment collections."
        }
      ],
      "discResult": "S+C",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nConscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.",
      "englishScore": "95",
      "englishDescription": "Communicates fluently and naturally with clear pronunciation and strong command of grammar. Uses a wide range of vocabulary and expressions to convey ideas accurately and confidently across various topics.",
      "education": {
        "school": "The University of Texas at El Paso (UTEP)",
        "degree": "Bachelor of Business Administration in International Business",
        "date": "2022"
      },
      "sourceFile": "AlejandroProfile.jsx"
    },
    {
      "name": "ANA",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Ana.webp",
      "summary": "Bilingual virtual assistant, proficient, experienced in handling complex administrative tasks and supporting customer focused strategies. Passionate about using technology to streamline processes and achieve results. Effectively manage a variety of responsibilities, such as:",
      "tagline": "She is ready to make an immediate impact on your business\\",
      "videoUrl": "https://www.youtube.com/embed/XloA9MBGtGA",
      "skills": [
        "Insurance Claim Submission",
        "Payment Link Sending",
        "Outstanding Balance Tracking",
        "Explanation of Benefits (EOB)",
        "Appointment Scheduling",
        "Patient Followup",
        "Insurance Verification",
        "Dental Software Navigation",
        "Email & Calendar",
        "Inbound & Outbound Calls",
        "Administrative Support",
        "Team Collaboration",
        "Cross-Department Assistance"
      ],
      "tools": [
        "Canva",
        "Zoho CRM",
        "Opera Software",
        "Microsoft Office",
        "Zoom Workplace",
        "Google Workspace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "GIBSON HOTEL",
          "position": "Reservations Agent",
          "period": "JUL 2023 - DEC 2023",
          "description": "• Project Management: Managed multi-channel guest reservations to a high standard while multitasking customer interactions and administrative tasks.\\n• Customer Centric & Communication: Successfully closed international sales by understanding client needs and effectively communicating with relevant teams for seamless services.\\n• Administrative Functions: Managed the entire reservation process, coordinated with departments, ensured timely and accurate administrative work, and maintained the sales/events calendar for strategic alignment.\\n• Technology Savvy: Improved booking processes and customer satisfaction by utilizing new technologies and quickly adapting to various software systems."
        },
        {
          "company": "HILTON DUBLIN HOTEL",
          "position": "Front Office",
          "period": "MAR 2022 - JUN 2023",
          "description": "• Strategic & Communication Skills: Effectively coordinated with various departments to achieve desired guest experiences, demonstrating a customer-focused approach and clear communication with the sales team and other departments in support of the hotels strategic objectives.\\n• Multitasking & Process Control: Managed check-ins/outs, customer complaints, and administrative tasks, ensuring smooth operations and control of the entire process.\\n• Support to Executive Level: Provided support to senior management by ensuring that all guest-related operations were aligned with the broader business strategy."
        },
        {
          "company": "SMART FIT DUBLIN",
          "position": "Front Office",
          "period": "APR 2019 - JAN 2022",
          "description": "• Cross-Cultural Communication & Customer Centric: Communicated effectively with diverse clients, ensuring excellent customer service. Promoted the brand via social media and used tailored marketing for different cultures.\\n• Administrative Functions & Technology Savvy: Produced detailed daily/weekly sales reports for strategic insights. Reconciled accounts, managed payments, and used CRM/technology to improve operations and customer relations."
        },
        {
          "company": "AMEX ASSURANCE COMPANY",
          "position": "Claims Assessor",
          "period": "JUN 2018 - FEB 2019",
          "description": "• Customer Centric & Communication: Actively listened to customer calls, providing accurate and efficient service based on customer experiences.\\n• Administrative Functions: Prepared and recorded insurance policy/claims data in the database accurately and compliantly.\\n• Process Control: Completed tasks on time, meeting customer expectations and maintaining high service standards."
        }
      ],
      "discResult": "S+C",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nConscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.",
      "englishScore": "7.3",
      "englishDescription": "Communicates clearly with strong fluency and minimal pauses. Pronunciation is consistently clear and easy to understand. Uses a broad range of vocabulary, including idiomatic expressions, and applies complex grammar structures effectively to express ideas with accuracy and coherence.",
      "education": {
        "school": "Dublin Business School | Dublin, Ireland",
        "degree": "Bachelor of Arts (Hons) in Business",
        "date": "NOV 2022"
      },
      "sourceFile": "AnaProfile.jsx"
    },
    {
      "name": "ANA VICTORIA",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Ana Victoria.webp",
      "summary": "Bilingual Virtual Assistant with hands-on experience in insurance support services, customer interaction, and administrative coordination. With strong bilingual communication skills and a proactive approach, Ana Victoria confidently manages responsibilities such as:",
      "tagline": "Ana Victoria provides dependable, high-level support that empowers busy professionals to concentrate on scaling their business.",
      "videoUrl": "https://www.youtube.com/embed/1d4dWgjd0fE",
      "skills": [
        "Commercial Trucking Insurance",
        "Inbound & Outbound Calls",
        "Data Entry & CRM",
        "Policy Changes",
        "Client Issue Resolution",
        "Calendar & Email Management",
        "Quote Creation",
        "Endorsements",
        "Insurance Policy Reviews",
        "Payment Assistance",
        "COIs Documentation"
      ],
      "tools": [
        "Google Suite",
        "Zoom Workplace",
        "Geico & Progressive Portals",
        "CRMs",
        "Nowcerts"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "LEARNEX ENGLISH COMMUNITY",
          "position": "Learning Advisor",
          "period": "MAY 2023 - PRESENT",
          "description": "• English community for spanish speakers. Teaching english through conversation."
        },
        {
          "company": "LA POSADA DEL BUEN SAMARITANO IAP",
          "position": "Cognitive Behavioral Therapy",
          "period": "FEB 2023 - JUN 2023",
          "description": "• Cognitive behavioral therapy to individuals and groups.\\n• Addictions rehab center for woman"
        },
        {
          "company": "SOCIAL SERVICE DEPARTMENT (UNISON)",
          "position": "Data Entry and Customer Service",
          "period": "FEB 2019 - DEC 2019",
          "description": "• Offering attention by phoneto students gaint through their social service process, supporting or guidingthem to find a solutionto their doubt.\\n• Data entry to the social service software"
        },
        {
          "company": "MEX CALL CENTER",
          "position": "Telemarketing",
          "period": "JAN 2021 - JUN 2021",
          "description": "• Identifying prospects, operating telephone equipment, giving product information, and updating customer databases.\\n• Assists in prospect follow-up and support of sales activities"
        },
        {
          "company": "MAD SHOP ONLINE STORE",
          "position": "Social Media Assistant",
          "period": "AUG 2021 - JAN 2022",
          "description": "• Posting content and interacting with clients through social media.\\n• Customer service(live chat)"
        }
      ],
      "discResult": "S+I",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nInfluence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "7.3",
      "englishDescription": "Speaks fluently with clear pronunciation and minimal accent. Uses a broad vocabulary and complex grammar structures to express ideas effectively and coherently.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "AnaVictoriaProfile.jsx"
    },
    {
      "name": "ANTONIO",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Antonio.webp",
      "summary": "Dedicated and highly organized Virtual Assistant with strong experience in the insurance industry, client communication, and back-office operations. He has supported North American insurance agencies, demonstrated excellent knowledge of corridor systems, CRM tools, and quoting platforms.",
      "tagline": "Antonio brings vast insurance expertise, responsiveness, and a service-oriented mindset. With a strong commitment to quality and timeliness, he\\",
      "videoUrl": "https://www.youtube.com/embed/3b3R9YoLumE?t=2s",
      "skills": [
        "Customer Service",
        "Claims Entry",
        "Policy Quoting",
        "Mortgage Updates",
        "Billing Assistance",
        "Email & Calendar Management",
        "Policy Changes",
        "Manual Renewals",
        "Cancellation Reporting",
        "Personal Lines Insurance",
        "COI Generation",
        "Cancellations",
        "CRM & Database Updates"
      ],
      "tools": [
        "PL Rater",
        "Ezlynx",
        "Carrier Portals",
        "Google Workspace",
        "Microsoft Office",
        "Zoom Workplace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "TOWE INSURANCE SERVICE - VIRGINIA",
          "position": "Virtual Assistant",
          "period": "SEPT 2022 - APR 2025",
          "description": "• Handled full-cycle policy servicing for auto and home insurance including quoting, endorsements, billing inquiries, mortgage changes, and CRM updates using PL Rater, Partner XE, and Ezylynx."
        },
        {
          "company": "BILLIYARD INSURANCE GROUP- CANADA",
          "position": "Underwriter",
          "period": "NOV 2023 - MAR 2025",
          "description": "• Reviewed and issued auto and home insurance policies by validating producer-submitted quotes and correcting errors via Applied Rating Services across multiple carrier portals."
        },
        {
          "company": "SITEL PHILIPPINES - INBOUND SALES",
          "position": "Customer Service Representative",
          "period": "JAN 2021 - AUG 2022",
          "description": "• Delivered empathetic and efficient customer support, consistently ranked among top agents, and served as Subject Matter Expert (SME) for four months."
        },
        {
          "company": "STA. CRUZ NATIONAL HIGH SCHOOL",
          "position": "Public High School Teacher",
          "period": "JUN 2019 - OCT 2020",
          "description": "• Facilitated classroom instruction and holistic student development by integrating values and managing daily academic activities."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "75",
      "englishDescription": "Communicates clearly on familiar topics with good control of basic grammar and vocabulary. Pronunciation is clear, and speech flows naturally with occasional pauses. Confident in expressing ideas in everyday conversations.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "AntonioProfile.jsx"
    },
    {
      "name": "BALBINA",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Balbina.webp",
      "summary": "Balbina is a highly organized and results-driven Virtual Assistant with a strong background in operations supervision and customer service. With over four years of experience in customer relations and two years in leadership roles, she has successfully managed teams, optimized workflows, and achieved team satisfaction. Her expertise includes:",
      "tagline": "Balbina is proactive, detail-oriented, and always focused on delivering excellence. Click here to learn more about her.",
      "videoUrl": "https://www.youtube.com/embed/sESom3C4Tjk",
      "skills": [
        "Process Improvement",
        "Team Leadership & Supervision",
        "Operational Efficiency",
        "Customer Service",
        "Complaint Resolution",
        "Appointment Scheduling",
        "Time Management",
        "Performance Monitoring & Coaching",
        "Administrative Support"
      ],
      "tools": [
        "Avaya",
        "Pega",
        "Tableau",
        "Zoho",
        "Power BI",
        "Microsoft Office",
        "Google Workspace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "MAJOREL",
          "position": "Operations Supervisor",
          "period": "2021 - 2024",
          "description": "• Processing Quote in PL Rater and QuoteRush\\n• Monitoring Payment Status\\n• Accounts receivable - payment follow-up\\n• Processing Direct Bill Statements\\n• Reconciliation of Agency Commission Statements\\n• Basic Bookkeeping\\n• Making phone calls to Mortgage Companies, Lien holders, and clients"
        },
        {
          "company": "TELVISTA",
          "position": "Customer Service Agent",
          "period": "2019 - 2020",
          "description": "• Assist customers with car rental inquiries, reservations, and issues\\n• Identify and report potential security risks vulnerabilities.\\n• Meet and exceed customer satisfaction and quality targets."
        }
      ],
      "discResult": "I",
      "discResultDescription": "Influence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "7.2",
      "englishDescription": "Communicates effectively with clear pronunciation. Demonstrates strong fluency with minor pauses and uses a diverse vocabulary, including idiomatic expressions. Conveys complex ideas well with generally accurate grammar and structured speech.",
      "education": {
        "school": "UTEL / CETYS Preparatoria",
        "degree": "Business Administration / High School",
        "date": "2023 - 2025 / 2016 - 2019"
      },
      "sourceFile": "BalbinaProfile.jsx"
    },
    {
      "name": "BRANDON L.",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Brandon L.webp",
      "summary": "Highly resourceful and analytical Virtual Assistant with over 7 years of experience in customer service and administrative support. Brandon has worked across real estate, home improvement industries, excelling in both remote and fast-paced environments. Brandon thrives in roles that demand precision, proactive communication, and strategic thinking.",
      "tagline": "Brandon is committed to delivering accurate and detail-oriented virtual support tailored to the needs of property management and client service operations.",
      "videoUrl": "https://www.youtube.com/embed/PVmxKa19Mz0",
      "skills": [
        "Email & Calendar Management",
        "Tenant & Resident Relations",
        "Documentation & Reporting",
        "Lead & Data Verification",
        "Service Request Tracking",
        "Property Maintenance",
        "Vacancy Scheduling",
        "Customer Service",
        "Inbound & Outbound Calls",
        "Lease & Documentation Support"
      ],
      "tools": [
        "Salesforce",
        "SQL",
        "Power BI",
        "Buildium",
        "AppFolio",
        "Microsoft Office"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "TRUE WORK",
          "position": "Logistics",
          "period": "MAY 2023 - JUL 2024",
          "description": "• Enter service requesting software and respond immediately by phone to reside\\n• Follow up with residents on completed work orders\\n• Schedule and track vacant unit turns"
        }
      ],
      "discResult": "S+I",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nInfluence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "7.2",
      "englishDescription": "Indicates advanced English proficiency with the ability to understand and use complex language. Suitable for effective communication in professional, academic, and social settings with fluency and confidence.",
      "education": {
        "school": "Universidad Autónoma de México",
        "degree": "Bachelor\\",
        "date": "AUG 2019 - DEC 2024"
      },
      "sourceFile": "BrandonLProfile.jsx"
    },
    {
      "name": "CAROLINA",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Carolina.webp",
      "summary": "Experienced bilingual virtual assistant with a solid background in real estate and project management across the fashion and automotive industries. Her comprehensive expertise enables her to effectively manage responsibilities such as:",
      "tagline": "Ready to help drive your business growth from day one! Click here to learn more about her.",
      "videoUrl": "https://www.youtube.com/embed/_3cmkdxncdg",
      "skills": [
        "Email & Calendar",
        "Billing & Invoice Processing",
        "Policy Payments",
        "Incoming Installments Tracking",
        "Inbound & Outbound Calls",
        "Purchase Order Creation",
        "Financial Analysis",
        "Policy Updates",
        "Quoting",
        "Customer Service",
        "Mortgagee Updates",
        "Policy Renewals",
        "Certificates of Insurance Issue"
      ],
      "tools": [
        "SAE",
        "Citrix",
        "Contpaq",
        "AdminPaq",
        "Ezlynx",
        "MS Office",
        "Google Workspace",
        "Zoom Workplace",
        "InsuredMine"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "GORDIAN STAFFING",
          "position": "Accounting Clerk",
          "period": "2022 - 2025",
          "description": "• Managed real estate administrative tasks including property onboarding, deed reviews, and client communication for a U.S.-based property firm."
        },
        {
          "company": "TECH STYLE",
          "position": "Production Assistant",
          "period": "2021 - 2022",
          "description": "• Oversee customs procedures, coordinated with brokers and transport providers, and supported internal teams with shipping documentation and operations."
        },
        {
          "company": "JATCO MEXICO",
          "position": "Staff Tool Division",
          "period": "2020 - 2022",
          "description": "• Handled recruitment logistics, coordinated job fairs, managed candidate evaluations, and provided bilingual support across HR functions."
        },
        {
          "company": "NR FINANCE",
          "position": "Funder I",
          "period": "2017 - 2019",
          "description": "• Supported financial processes by managing purchase orders, updating internal records, and coordinating with vendors for account payables."
        }
      ],
      "discResult": "C+S",
      "discResultDescription": "Conscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.\\n\\nSteadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "6.9",
      "englishDescription": "Communicates clearly with good fluency and coherence. Pronunciation is strong and easily understood. Uses a sufficient vocabulary and complex grammar structures with flexibility, effectively expressing complex thoughts.",
      "education": {
        "school": "TEC Milenio",
        "degree": "Bachelor of Business Administration",
        "date": "2011 - 2016"
      },
      "sourceFile": "CarolinaProfile.jsx"
    },
    {
      "name": "CHERRY MAE",
      "title": "INSURANCE VIRTUAL ASSISTANT | DATA ENTRY SPECIALIST",
      "image": "/images/VAs/Cherry Mae.webp",
      "summary": "With one year of experience in the U.S. insurance industry, Cherry Mae is a dependable Virtual Assistant specializing in personal lines. She provides brokers with accurate and efficient support by preparing quotes, managing compliant data entry across carrier portals, and ensuring organized, error-free documentation for client satisfaction.",
      "tagline": "Cherry Mae combines precision, organization, and strong administrative support skills to ensure seamless insurance operations for brokers and clients alike.",
      "videoUrl": "https://www.youtube.com/embed/DIfncidHCpY",
      "skills": [
        "Accuracy Audits & Compliance Checking",
        "Personal Lines Quoting & Renewals",
        "Client Data Management",
        "Quote Comparison & Remarketing",
        "Administrative & Broker Support",
        "Policy Documentation & Verification",
        "Watercraft Motorcycle and Recreational Vehicle Quoting",
        "Insurance Data Entry & Recpro Maintenance"
      ],
      "tools": [
        "Applied Epic",
        "Quickbooks",
        "Canva",
        "Slack",
        "Loom",
        "Krisp",
        "Microsoft Office",
        "Citrix Workspace",
        "Notion",
        "Zoom Workplace",
        "Docusign",
        "Capcut"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "SUPPORT ZEBRA (BPO)",
          "position": "Insurance Virtual Assistant",
          "period": "2024 - 2025",
          "description": "• Reviewed and verified quote sheets based on broker requests, flagging missing or inconsistent data to clarify policy details and resolve discrepancies.\\n• Entering customer data into multiple carrier websites.\\n• Developed and sent PDF quotes to brokers, including emails detailing rates and premiums.\\n• Created and maintained detailed comparison spreadsheets to support client decision-making and streamline policy selection.\\n• Scrubbed and organized client records in internal databases, improving data integrity and enhancing follow-up efficiency.\\n• KPI: Maintained a zero-error rate in insurance data entry through validation and compliance with standard processes."
        },
        {
          "company": "BOOM MARINE CORPORATION",
          "position": "Sales Accounting Specialist",
          "period": "2018 - 2024",
          "description": "• Analyzing sales performance data, revenue trends, and product performance.\\n• Identifying sales opportunities, risks, and patterns.\\n• Managed Accounts Receivable by issuing invoices and generating Aged Receivable Analysis, which strengthened collection efforts and reduced overdue accounts.\\n• Allocated purchase orders and booked customer orders based on actual production and available stock, ensuring timely fulfillment and efficient inventory use.\\n• Handled daily cash deposits and petty cash with accurate reconciliation, while collaborating with sales and finance teams to align targets and improve forecasting."
        },
        {
          "company": "GOODFORCE TRADING, INC.",
          "position": "Accounts Payable Specialist",
          "period": "2017 - 2018",
          "description": "• Processed and verified a high volume of vendor invoices with accuracy, ensuring compliance with company policies and payment terms.\\n• Matched purchase orders, receipts, and invoices (3-way matching) to prevent discrepancies and unauthorized payments.\\n• Prepared and scheduled vendor payments via checks, bank transfers, and other payment methods, ensuring timely disbursements.\\n• Maintained vendor files and reconciled monthly statements to resolve outstanding balances or disputes.\\n• Assisted in month-end closing activities by preparing accounts payable reports and supporting documentation.\\n• Coordinated with procurement and warehouse teams to resolve billing and delivery discrepancies.\\n• Ensured compliance with internal controls and audit requirements."
        },
        {
          "company": "AZPIRED, INC. (BPO)",
          "position": "Customer Service Representative (E-Commerce)",
          "period": "2017 - 2018",
          "description": "• Delivered timely and professional support through email and chat, addressing customer inquiries, order issues, refunds, and product concerns.\\n• Maintained a high level of customer satisfaction by providing clear resolutions and proactive communication.\\n• Documented customer interactions and resolutions in the system to ensure accurate records and smooth follow-ups.\\n• Assisted customers with order tracking, product information, returns, and replacements, ensuring a seamless shopping experience.\\n• Met and exceeded performance metrics, including response time, accuracy, and customer satisfaction ratings."
        }
      ],
      "discResult": "S+C",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nConscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.",
      "englishScore": "95",
      "englishDescription": "Shows exceptional fluency and clear pronunciation with natural, confident delivery. Uses advanced vocabulary and complex grammar accurately to express nuanced and well-structured ideas.",
      "education": {
        "school": "Tagoloan Community College",
        "degree": "Bachelor of Science in Business Administration - Finance",
        "date": "2008 - 2012"
      },
      "sourceFile": "CherryMaeProfile.jsx"
    },
    {
      "name": "CHRISTINE",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Christine.webp",
      "summary": "Christine is a highly skilled and detail-oriented Virtual Assistant with expertise in administrative support, e-commerce management, insurance and bookkeeping, and customer service. Her ability to multitask, problem-solve, and maintain high accuracy makes her a valuable asset to any team.",
      "tagline": "Christine is resourceful, proactive, and dedicated to helping businesses operate efficiently while providing excellent support. Click here to learn more about her.",
      "videoUrl": "https://www.youtube.com/embed/m0n5unGQ1Bk",
      "skills": [
        "Policy Processing",
        "Basic Bookkeeping & Accounts Receivable",
        "Data Management",
        "Home & Auto Insurance Quoting",
        "Certificates of Insurance Issue",
        "Product & Market Research",
        "Customer Service",
        "Email & Calendar Management",
        "Insurance Documentation",
        "Social Media Management",
        "PPC Campaign Management",
        "Payment Monitoring"
      ],
      "tools": [
        "Zoho",
        "PL Rater",
        "QuoteRush",
        "QuickBooks",
        "Nowcerts",
        "PPC Management",
        "Microsoft Office",
        "Google Workspace",
        "Amazon Seller Central"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "INSURANCE COMPANY",
          "position": "Personal Lines VA",
          "period": "JUN 2022 - MAR 2024",
          "description": "• Processing Quote in PL Rater and QuoteRush\\n• Sending Invoices and reviewing receipts\\n• Monitoring Payment Status\\n• Maintaining and updating Client details to CRM\\n• Accounts receivable - payment follow-up\\n• Auditing Nowcerts Renewal Center and Lost report\\n• Processing Direct Bill Statements\\n• Processing New business documents and Renewals\\n• Reconciliation of Agency Commission Statements\\n• Processing Mortgage Change\\n• Basic Bookkeeping\\n• SOP Creation\\n• Making phone calls to Mortgage Companies, Lien holders, and clients\\n• General Research"
        },
        {
          "company": "INSPIRATEK AND ECOTERO",
          "position": "Amazon Marketing VA",
          "period": "NOV 2021 - AUG 2022",
          "description": "• Keyword Research\\n• PPC Campaign Management\\n• FB Ads Management\\n• Influencer Marketing\\n• Social Media Management\\n• Competitor Research\\n• Social Media Management"
        },
        {
          "company": "OFP OUTSOURCING",
          "position": "Amazon Business Manager",
          "period": "SEP 2021 - NOV 2021",
          "description": "• Product Research\\n• Product Sourcing\\n• Product Listing\\n• Optimizing Product Listing Content"
        },
        {
          "company": "NOWCERTS CSR",
          "position": "Personal and Commercial Lines",
          "period": "SEP 2021 - NOV 2021",
          "description": "• Processing and sending COI/EOI to Certificate Holders\\n• Monitoring of Pending Cancellations\\n• Processing Direct Bill Statements\\n• Sending Notice of Cancellation to Insured via Zoho (Email and SMS)\\n• Reconciliation of Agency Commission Statements\\n• Data Entry of Company Expenses thru QuickBooks\\n• Processing Quote in PL Rater and QuoteRush\\n• Administrative Task"
        }
      ],
      "discResult": "C+D",
      "discResultDescription": "Conscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.\\n\\nDominance (D) - Proactive and goal-driven. D-type VAs take initiative, solve problems efficiently, and thrive in fast-paced environments.",
      "englishScore": "7.3",
      "englishDescription": "Communicates clearly with strong fluency and coherence. Pronunciation is easily understood. Uses a flexible vocabulary with idiomatic expressions and complex grammar structures, effectively developing topics.",
      "education": {
        "school": "Universidad de Manila",
        "degree": "Bachelor of Science in Business Administration",
        "date": "2012 - 2016"
      },
      "sourceFile": "ChristineProfile.jsx"
    },
    {
      "name": "DAFNE",
      "title": "INSURANCE VIRTUAL ASSISTANT",
      "image": "/images/VAs/Dafne.webp",
      "summary": "Dafne is a dedicated and detail-oriented professional with experience in patient care, customer service, and insurance operations. She has successfully supported clients by resolving billing inquiries, providing accurate personal lines insurance quotes, and maintaining strong client relationships through effective communication.",
      "tagline": "Dafne is the ideal Virtual Assistant for insurance agencies and service-based businesses seeking a multilingual, detail-oriented professional with expertise in billing support, client communication, and customer care.",
      "videoUrl": "https://www.youtube.com/embed/habJY_0mpjs",
      "skills": [
        "Client Support",
        "Personal Lines Insurance Quoting",
        "Issue Resolution",
        "Inbound & Outbound Calls",
        "Email & Multichannel Communication",
        "Patient Care",
        "Client Retention",
        "Billing Inquiries",
        "Customer Service"
      ],
      "tools": [
        "Pilater",
        "AppJedepic",
        "Google Workspace",
        "Microsoft Office"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "OCEAN VIRTUAL ASSISTANT SOLUTIONS",
          "position": "Virtual Assistant",
          "period": "JUL 2024 - OCT 2025",
          "description": "• Resolved billing inquiries in a timely and professional manner, improving customer satisfaction.\\n• Provided accurate quotes for personal lines insurance, resulting in increased sales.\\n• Developed strong relationships with clients through effective email communication and issue resolution."
        },
        {
          "company": "BOOMSOURCING",
          "position": "Medical and Auto Insurance Qualifier",
          "period": "AUG 2022",
          "description": "• Outbound calls.\\n• More than 400 calls a day."
        },
        {
          "company": "SURGE CALL BPO - USA",
          "position": "Customer Service Representative",
          "period": "FEB 2022 - JUL 2022",
          "description": "• Making refunds if customer is not happy with the products.\\n• Cancelling memberships and subscriptions upon customer request.\\n• Resolving billing-shipping questions.\\n• Described product highlights.\\n• Used to have 25 different campaigns.\\n• Became a manager for one camp."
        },
        {
          "company": "ATENTO",
          "position": "Bilingual Customer Service Representative",
          "period": "OCT 2021 - DEC 2021",
          "description": "• Processed orders, credits and raised returns.\\n• Answered up to 90 calls per day in busy, fast-paced office for both English and Spanish-speaking customers.\\n• Described product highlights and benefits to help guide purchasing decisions."
        }
      ],
      "discResult": "S+I",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nInfluence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "6.1",
      "englishDescription": "Speaks with clarity and understandable pronunciation, showing steady progress in fluency. Can express ideas using everyday vocabulary and grammar, with growing ability to handle more complex sentences.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "DafneProfile.jsx"
    },
    {
      "name": "DAWN",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Dawn.webp",
      "summary": "Dawn is a detail-oriented Virtual Assistant with over 6 years of combined experience in insurance support, sales operations, and administrative coordination. Dawn is also skilled in customer service, team supervision, and daily operations—making her an excellent all-around support professional.",
      "tagline": "Dawn\\",
      "videoUrl": "https://www.youtube.com/embed/fMWR-UrNXAg",
      "skills": [
        "Quote Proposal Generation",
        "Client Inquiry Handling",
        "Policy Implementation",
        "Email Management",
        "Customer Service",
        "Inventory Oversight",
        "Transaction Auditing",
        "Insurance Support (Home & Auto)",
        "Policy Changes",
        "Sales Operations"
      ],
      "tools": [
        "Callfire",
        "Carrier Portals",
        "Email Systems",
        "Zoom Workplace",
        "Google Workspace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "SABELLA MKTG. CORPORATION",
          "position": "Area Sales Supervisor",
          "period": "JUL 2011 - AUG 2016",
          "description": "• Responsible for day to day sales operations and inventory.\\n• Implementing policies and delegate duties properly.\\n• Handles hiring and recruitment process."
        },
        {
          "company": "UNITPACE CORPORATION",
          "position": "Mall Checker/Cashier",
          "period": "NOV 2007 - MAY 2010",
          "description": "• Ensures transactions made by the cashier are accurate and assist cashier on duty.\\n• Act as a Department Supervisor ensuring that the day to day operation runs smoothly and efficiently."
        }
      ],
      "discResult": "S+I",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nInfluence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "90",
      "englishDescription": "Speaks fluently and confidently on a wide range of topics. Demonstrates strong command of vocabulary and idiomatic language. Pronunciation is clear and natural, with consistent grammatical accuracy and the ability to express complex ideas with ease.",
      "education": {
        "school": "Capitol University",
        "degree": "BSBA Major in Human Resource Management",
        "date": "2022 - 2023"
      },
      "sourceFile": "DawnProfile.jsx"
    },
    {
      "name": "DAYANA",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Dayana.webp",
      "summary": "Dayana is an experienced Customer Service professional with over 8 years of delivering exceptional customer support. She combines strong organizational skills with excellent problem-solving abilities and attention to detail, enabling her to build strong relationships and enhance brand reputation. Dayana is well-prepared to efficiently manage the following tasks:",
      "tagline": "Click to watch her Introduction Video.",
      "videoUrl": "https://www.youtube.com/embed/1xTnx_3MRPA",
      "skills": [
        "Quality Control",
        "Occupational Health & Safety Coordination",
        "Safety Audits Supervision",
        "Customer Support",
        "Data Entry",
        "Inbound & Outbound Calls",
        "Hazard Investigation & Corrective Actions",
        "Policy & Procedure Development",
        "Calendar & Email",
        "Emergency Readiness Coordination",
        "Appointment Scheduling",
        "Report Generation"
      ],
      "tools": [
        "Slack",
        "Lawmatics",
        "Smokeball",
        "CRM Systems",
        "Ring Central",
        "Microsoft Office",
        "Google Workspace",
        "Zoom Workplace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "NAVEX (MEDELLIN - REMOTE)",
          "position": "Customer Service Assistant",
          "period": "SEPT 2021 - SEPT 2024",
          "description": "• Provide friendly and attentive service by promptly responding to customer inquiries and processing order requests.\\n• Enhanced customer experience and brand reputation through attentive and helpful service.\\n• Built strong relationships with customers through courteous and professional communications.\\n• Built rapport with customers through courteous and professional communications."
        },
        {
          "company": "PREFEL (MEDELLIN - ON SITE)",
          "position": "Occupational Health and Safety Officer",
          "period": "OCT 2020 - MAY 2021",
          "description": "• Developed and enforced a range of programs, policies, and procedures aimed at minimizing workplace injuries and hazards.\\n• Examined hazardous incidents and accidents to uncover causes and provided corrective actions.\\n• Coordinated monthly fire ensuring emergency readiness, drills. Instructed staffers during fire drills to gain awareness of proper evacuation routes and reporting techniques.\\n• Supervised safety audits and oversaw investigations into plant quality issues."
        },
        {
          "company": "BILATERAL (MEDELLIN - ON SITE)",
          "position": "Customer Service Representative",
          "period": "OCT 2018 - SEPT 2020",
          "description": "• Assisted in fulfilling customer orders placed in person, via email, online, and by telephone.\\n• Maximized customer satisfaction by promptly resolving service issues.\\n• Handled confidential and sensitive data with discretion, reducing the risk of fraud and theft"
        },
        {
          "company": "AT&T EMERGIA (MEDELLIN - ON SITE)",
          "position": "Customer Service Representative",
          "period": "JAN 2016 - AUG 2018",
          "description": "• Resolved customer queries over the phone and by email.\\n• Ensured fine customer service by enthusiastically anticipating and catering to customer needs and requirements.\\n• Assisted customers with product related questions, feedback, and complaints.\\n• Re-scheduling appointments.\\n• Cross-selling for services and products"
        }
      ],
      "discResult": "I",
      "discResultDescription": "Influence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "7.7",
      "englishDescription": "Demonstrates excellent fluency and clear pronunciation. Communicates ideas effectively using a broad vocabulary, including idiomatic expressions. Uses complex grammar structures with flexibility, maintaining coherence and clarity.",
      "education": {
        "school": "CESDE - Colombia, Medellin",
        "degree": "Occupational Health and Safety Officer",
        "date": "2021"
      },
      "sourceFile": "DayanaProfile.jsx"
    },
    {
      "name": "ELLEN ROSE",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Ellen.webp",
      "summary": "Top-performing Virtual Insurance Assistant with comprehensive experience in personal lines insurance, including homeowners, auto, dwelling fire, umbrella, and health insurance. Known for her proactive mindset and professionalism, Ellen consistently delivers accurate, compliant, and timely insurance administrative support for U.S.-based clients.",
      "tagline": "Ellen Rose delivers reliable, precision-focused virtual assistance designed to support complex insurance processes and elevate client satisfaction.",
      "videoUrl": "https://www.youtube.com/embed/zgEzkCfI3Pw",
      "skills": [
        "Endorsements",
        "PPC Insurance Support",
        "Email & Calendar Management",
        "COIs Generation",
        "Customer Service",
        "Quoting Ezlynx & Carrier Portals",
        "Claims Coordination",
        "Cancellations",
        "Inbound & Outbound Calls",
        "Underwriting Support",
        "Document Preparation",
        "Renewals"
      ],
      "tools": [
        "Ezlynx",
        "Nowcerts",
        "Zoho",
        "Dialpad",
        "Zendesk",
        "Smart Lookup",
        "Google Calendar",
        "Google Suite",
        "Microsoft Excel (Advanced)"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "REGENCY INSURANCE GROUP",
          "position": "Virtual Assistant",
          "period": "MAY 2022 - JAN 2025",
          "description": "• This distinguished global firm offers efficient, risk-managed insurance solutions worldwide, with focus on serving in-house and outside teams.\\n• I delivered precise quotations with minimal premiums, submitted required documentation, and managed the entire quotation process from inception to conclusion.\\n• I processed endorsements, cancellations, and renewals, ensuring data compliance, tracked expirations by coordinating with clients and claims, and developed notes to prospects.\\n• I proactively communicated critical updates, including modified declarations and upcoming cancellations (with or without non-payment) to clients via multiple channels like call, email, and text."
        },
        {
          "company": "WOODBOWS (PART-TIME)",
          "position": "Life Insurance Virtual Assistant",
          "period": "APR 2024- DEC 2024",
          "description": "• I worked as a virtual assistant for a dynamic company with offices in the UK and operations located across the US, Philippines, and India.\\n• As Administrative Support, I managed client communications, scheduled agent appointments, prepared reports and summaries, and maintained client records and policy documents.\\n• I assisted clients with renewals, payments, and claims, answered basic inquiries, supported efficient onboarding, and addressed concerns and complaints.\\n• I processed insurance applications and renewals, ensured data compliance, tracked expirations by coordinating with clients and claims, and developed notes to prospects."
        },
        {
          "company": "TASKUS (PART-TIME)",
          "position": "General Virtual Assistant",
          "period": "AUG 2023- MAR 2024",
          "description": "• I helped provide next-generation outsourced digital and user experience services to innovative businesses, helping them protect their brand and maximize profits.\\n• As a customer experience representative, my primary responsibility was managing and responding to customer inquiries via various support channels, including voice, email, chat, social media, and messaging.\\n• I satisfied client expectations by providing introductory information to new customers, ensuring their satisfaction through follow-ups, and informing them about additional products or services.\\n• I determined difficult matters for responding to inquiries, escalated concerns when necessary, and collaborated with teams to find solutions for common product or service issues."
        },
        {
          "company": "ADVANCE VA (PART-TIME)",
          "position": "General Virtual Assistant",
          "period": "NOV 2022- JUL 2023",
          "description": "• I served as a general virtual assistant, managing emails and phone calls on behalf of my supervisor.\\n• I enhanced my essential oral and written communication skills through handling various business communications and resolving customer concerns and inquiries.\\n• I independently managed assigned administrative projects, consistently delivering high-quality work with minimal supervision.\\n• I became more dependable in handling tasks and built a trusting, productive working relationship with my team.\\n• My responsibilities included preparing appointments, maintaining online records, organizing management calendars, conducting market research, and developing presentations.\\n• I became more proficient in managing necessary resources in recognition of my consistently high performance."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "75/B1",
      "englishDescription": "Speaks clearly on familiar topics with good control of basic grammar and vocabulary. Pronunciation is generally clear, and ideas are communicated with confidence and coherence.",
      "education": {
        "school": "Quezon City University",
        "degree": "Bachelor of Science in Entrepreneurship",
        "date": "2022"
      },
      "sourceFile": "EllenRoseProfile.jsx"
    },
    {
      "name": "EMMANUEL",
      "title": "ENGLISH-SPEAKING VA | INSURANCE SPECIALIST",
      "image": "/images/VAs/Emmanuel.webp",
      "summary": "Emmanuel is a dedicated Insurance Virtual Assistant with over six years of industry experience including four years supporting U.S.-based agencies remotely. He specializes in both personal and commercial lines, handling auto, property, and business insurance with precision and reliability. His expertise includes quoting, renewals, endorsements, billing, claims coordination, and COI issuance for diverse client portfolios.",
      "tagline": "Emmanuel provides end-to-end insurance support, focusing on precision, responsiveness, and clear communication. He ensures accurate policies, efficient processes, and smooth collaboration among all parties.",
      "videoUrl": "https://www.youtube.com/embed/dZaAfgmaQwk",
      "skills": [
        "Commercial Auto",
        "Renewals",
        "Policy Servicing",
        "Carrier Coordination",
        "Personal Lines",
        "Claims Support",
        "Underwriting Assistance",
        "Billing",
        "Quotations",
        "Endorsements",
        "Mortgage Communication",
        "COI Issuance"
      ],
      "tools": [
        "Applied Epic",
        "Applied Rater",
        "PL Rater",
        "MS Outlook",
        "MS Teams",
        "Microsoft Office",
        "Zoom Workplace",
        "Ezlynx",
        "Slack"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "HAWAII PACIFIC NEUROSCIENCE",
          "position": "Patient Care Coordinator",
          "period": "JAN 2025 - JUN 2025",
          "description": "• Appointment setting – scheduling, managing cancellations, and sending reminders to patients.\\n• Calendar management – creating a schedule that includes appointments, meetings and events for providers/patients.\\n• Fax document Management.\\n• Follow-ups and checking on patients after appointments.\\n• Email management – responding to messages and cleaning your inbox.\\n• Taking incoming and outgoing calls and transfer urgent calls to providers/staffs."
        },
        {
          "company": "LAPOINTE INSURANCE AGENCY",
          "position": "Executive Virtual Assistant",
          "period": "OCT 2020 - OCT 2024",
          "description": "• Communicated with mortgagee company on payments, closings & binder updates.\\n• Generated binders and issuance of policies/COIs on various insurance carriers.\\n• Called mortgagee companies to check on mortgagee payments/settlements.\\n• Lead the agency group on mortgagee relations.\\n• Trained other VAs on the workflow and mortgagee relations systems.\\n• Process renewals, new business policies for Personal Home, Auto & Umbrella as well as Commercial Limos and trucks.\\n• Well versed on creating quotes using PLRater Applied Epic and efficient on creating multiple quotes for reshopping.\\n• Proficient on CRMS such as AMS360, Applied Epic, HawkSoft and Ezlynx."
        },
        {
          "company": "INSURANCE AUSTRALIA GROUP",
          "position": "Claims/Repairs Specialist",
          "period": "JUL 2019 - OCT 2020",
          "description": "• Validate claims lodged by the policyholder & check whether claim is acceptable or not.\\n• Process repairs invoices.\\n• Monitor repairs of policyholders Processing for repairs and other claim related settlements."
        },
        {
          "company": "PETSURE SERVICES – ANIMAL FRIENDS UK",
          "position": "Assessor",
          "period": "NOV 2019 - MAY 2019",
          "description": "• Assessed invoices and prepare settlements.\\n• Reviews/cross examine cases and filed claims."
        }
      ],
      "discResult": "I",
      "discResultDescription": "Influence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "85",
      "englishDescription": "Communicates clearly and confidently with smooth pronunciation and good fluency. Uses a broad vocabulary and varied grammar structures to express ideas effectively in most situations.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "EmmanuelProfile.jsx"
    },
    {
      "name": "FERNANDA",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Fernanda.webp",
      "summary": "Experienced and results-driven Virtual Assistant with over nine years of experience in key account management, sales operations, and marketing coordination. She consistently delivers top-quality support engagement, sales pipeline, and marketing coordination. She consistently delivers top-quality support engagement, sales pipeline, and marketing coordination. Her expertise includes:",
      "tagline": "Fernanda is organized, solution-oriented, and passionate about enhancing operational workflows while providing top-tier client support. Click here to learn more about her.",
      "videoUrl": "https://www.youtube.com/embed/7ngbNodl3es",
      "skills": [
        "Supplier & Vendor Coordination",
        "Client Relationship Management",
        "Proposal Creation",
        "Sales Metrics Creation",
        "Onboarding & Training",
        "Data Reporting",
        "Workflow Optimization",
        "CRM Support",
        "Relationship Management",
        "Calls Support"
      ],
      "tools": [
        "CRMs",
        "Zoho",
        "Teams",
        "Canva",
        "Microsoft Office",
        "Google Workspace",
        "Excel Pivot Tables"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "INMERA",
          "position": "Key Account Manager",
          "period": "JUL 2021 - SEP 2023",
          "description": "• Craft persuasive proposals tailored to customers specific needs and preferences\\n• Drafting professional, visually engaging sales material with great attention to detail using Canva and similar tools\\n• Prepare detailed reports and sales metrics to track performance and drive strategic decisions.\\n• Pivot table management.\\n• Handle and solve clients complaints by providing resourceful solutions and responding effectively to client requirements."
        },
        {
          "company": "TOTTO",
          "position": "Sales Assistant",
          "period": "AUG 2014 - NOV 2020",
          "description": "• Submit KPIs and relevant business metrics to track performance and client satisfaction.\\n• Address client requirements promptly, identifying plan points and providing effective solutions.\\n• Manage the onboarding process for sales agents"
        },
        {
          "company": "TOTTO",
          "position": "Marketing Assistant",
          "period": "OCT 2011 - AUG 2014",
          "description": "• Coordinate and Communicate effectively with agencies and suppliers to ensure smooth operations.\\n• Analyze and track marketing metrics to measure campaign performance and optimize strategies.\\n• Design professional advertisements with a strong visual impact and attention to detail.\\n• Support lead generation efforts by carrying out engaging potential customers."
        }
      ],
      "discResult": "I+S",
      "discResultDescription": "Influence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.\\n\\nSteadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "7.1",
      "englishDescription": "Communicates clearly with strong fluency and coherence. Pronunciation is easily understood with minimal accent. Uses a sufficient vocabulary and complex grammar structures with flexibility, effectively expressing complex thoughts.",
      "education": {
        "school": "Internacional University",
        "degree": "Master in Business Administration / Corporate Communicator",
        "date": "2023 - 2024 / 2008 - 2011"
      },
      "sourceFile": "FernandaProfile.jsx"
    },
    {
      "name": "FRANCIS",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Francis.webp",
      "summary": "Francis is an experienced Virtual Assistant with a deep background in insurance, eagles, and client relations. With a decade of experience across customer service and account management roles, Francis is licensed in Property & Casualty, Life, and Health insurance.",
      "tagline": "Francis is a seasoned professional ready to support insurance brokers, sales teams, and client service departments with integrity and proven experience.",
      "videoUrl": "https://www.youtube.com/embed/Atdu3qVBHLs?t=1s",
      "skills": [
        "Claims Resolution",
        "Consultative Sales",
        "Performance Coaching",
        "Lead Management",
        "Customer Service",
        "Escalation Management",
        "Campaign Planning",
        "Direct Sales",
        "Licensed Insurance Support (P&C, Life & Health)",
        "Team Training"
      ],
      "tools": [
        "Insurance Quoting Systems",
        "CRM & Call Center Tools",
        "Microsoft Office",
        "Google Workspace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "EVERGREEN PUBLIC ADJUSTER SERVICES",
          "position": "Account Manager",
          "period": "JULY 2025 - 2025",
          "description": "• Developed and implemented strategies to increase business and revenue for the company.\\n• Recognized as a top performer by consistently exceeding monthly quotas.\\n• Resolved complex customer issues in a timely manner while maintaining positive relationships with clients."
        },
        {
          "company": "PREFERRED PARTNERS GROUP",
          "position": "Sales Manager",
          "period": "NOV 2011 - JUL 2019",
          "description": "• Prepare and Launch sales campaigns for our clients.\\n• Manage a team of sales people to ensure they have the support they need to be successful.\\n• Interview and train new sales representatives.\\n• Provided coaching and feedback to staff on an ongoing basis in order to improve job performance."
        },
        {
          "company": "LIBERTY MUTUAL INSURANCE",
          "position": "Insurance Agent",
          "period": "FEB 2008 - NOV 2011",
          "description": "• Demonstrated excellent communication skills when discussing insurance policies with customers to ensure they were fully informed of their coverage options.\\n• Used company software to analyze customer coverage needs, write quotes, and issue policies.\\n• Built and maintained relationships with clients to support satisfaction."
        }
      ],
      "discResult": "I",
      "discResultDescription": "Influence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "85",
      "englishDescription": "Indicates upper-intermediate English proficiency with the ability to communicate clearly and effectively in a variety of contexts. Can understand and produce more complex language with a strong command of both spoken and written.",
      "education": {
        "school": "Christian Vocational Academy, Dallas, TX",
        "degree": "High School Diploma",
        "date": "JUNE 2005"
      },
      "sourceFile": "FrancisProfile.jsx"
    },
    {
      "name": "GERALDINE",
      "title": "INSURANCE VIRTUAL ASSISTANT",
      "image": "/images/VAs/Geraldine.webp",
      "summary": "Geraldine is an experienced Insurance Virtual Assistant with a strong background in Commercial and Personal Lines support, customer service, and sales operations. From 2021 to 2024, she worked as an Insurance VA where she managed quoting, policy check-ins, processing endorsements, preparing renewal proposals, sending cancellation notices, and assisting with claims filing.",
      "tagline": "Geraldine is the ideal Virtual Assistant for insurance agencies, customer service teams, and sales-driven organizations seeking a detail-oriented professional with hands-on insurance knowledge and strong client communication skills.",
      "videoUrl": "https://www.youtube.com/embed/OAEGigybmFM",
      "skills": [
        "Upselling & Cross-Selling",
        "Policy-Checking",
        "Customer Service",
        "Order Processing",
        "Insurance Quoting & Proposals",
        "Documentation",
        "Commercial & Personal Lines",
        "Renewals & Endorsements",
        "Claims Assistance",
        "Technical Support",
        "Sales Support"
      ],
      "tools": [
        "Applied Epic",
        "Ezlynx",
        "Salesforce",
        "Zendesk",
        "Dash",
        "Ease",
        "Microsoft Office",
        "Google Workspace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "INSURANCE VA",
          "position": "Insurance Virtual Assistant",
          "period": "OCT 2021 - MAY 2024",
          "description": "• Handled policy quoting, endorsements, ACORD forms, renewals, cancellations, and insurance documentation for Auto, Home, and Commercial lines while supporting U.S.-based insurance agencies."
        },
        {
          "company": "ALORICA",
          "position": "Customer Service Representative",
          "period": "MAR 2021 - SEPT 2021",
          "description": "• Assisted U.S.-based customers with billing concerns and account inquiries for a telecommunications provider in a high-volume call center."
        },
        {
          "company": "TELETECH",
          "position": "Customer Service Representative",
          "period": "NOV 2019 - JAN 2021",
          "description": "• Provided billing and account support to clients of a major U.S. telecommunications company, resolving service-related issues effectively."
        }
      ],
      "discResult": "S+C",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nConscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.",
      "englishScore": "75",
      "englishDescription": "Communicates clearly with good pronunciation and generally fluent speech. Uses a solid vocabulary and grammar range to express ideas effectively, with growing flexibility.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "GeraldinProfile.jsx"
    },
    {
      "name": "GIZELLE",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Gizelle.webp",
      "summary": "English-speaking Virtual Assistant with extensive experience in customer service, administrative support, and health insurance assistance. Gizelle is highly adaptable, client-oriented, and a novice in managing multiple tasks efficiently. She is ready to start immediately and can assist with the following:",
      "tagline": "Gizelle is excited to collaborate and bring her expertise to your team. Click here to connect and see how she can help!",
      "videoUrl": "https://www.youtube.com/embed/xkbMKgYarbk",
      "skills": [
        "Meeting Scheduling",
        "Confidential Data Management",
        "Insurance Policy Update",
        "Customer Support",
        "Calendar & Email Management",
        "Administrative Support",
        "Data Entry",
        "Claims Assistance",
        "Insurance Verification & Eligibility",
        "Billing & Transactions"
      ],
      "tools": [
        "Zoho",
        "Zendesk",
        "Zoom Workplace",
        "Google Workspace",
        "Microsoft Office",
        "Insurance & Financial Systems"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [],
      "discResult": "S+I",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nInfluence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "6.3",
      "englishDescription": "Communicates understandably with fluency and coherence. Pronunciation is generally clear. Uses an adequate vocabulary and grammar structures with some flexibility and effectively conveying ideas.",
      "education": {
        "school": "Our Lady of Fatima University / Don An Roces Sr. Science & Technology High School / Uson Elementary School",
        "degree": "BS Business Administration Major in Banking and Finance / High School / Elementary",
        "date": "2016-2021 / 2009-2013 / 2003-2009"
      },
      "sourceFile": "GizelleProfile.jsx"
    },
    {
      "name": "GONZALO",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Gonzalo.webp",
      "summary": "Resourceful Virtual Assistant with proven insurance sector experience who is also insurance trained. With great interpersonal and communication skills and looking forward to skillfully handle tasks.",
      "tagline": "Gonzalo is fully equipped to support insurance agencies, real estate businesses, and professionals seeking a proactive, detail-oriented assistant.",
      "videoUrl": "https://www.youtube.com/embed/DYky1VhKGNQ",
      "skills": [
        "Claims Processing & Handling",
        "Client Satisfaction & Relationship",
        "Event Scheduling & Coordination",
        "Complaint Resolution",
        "Data Entry & Management",
        "Cancellation Handling",
        "Inbound & Outbound Calls",
        "Account Management",
        "Renewals & Endorsements",
        "Policy Support & Follow-up"
      ],
      "tools": [
        "CRM",
        "Hawksoft",
        "Ezlynx",
        "Hubspot",
        "Google Suite",
        "Microsoft Office",
        "Zoom Workplace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "EDGE SA",
          "position": "Senior Associate",
          "period": "DEC 2021 - MAY 2024",
          "description": "• Supported a U.S.-based insurance agency by handling reporting, process automation, data collection, and administrative tasks across Auto, Home, and Commercial lines."
        },
        {
          "company": "TELEPERFORMANCE PERÚ",
          "position": "Bilingual Agent - Floor Support",
          "period": "DEC 2020 - DEC 2021",
          "description": "• Provided bilingual customer service and operational support, resolved escalated inquiries, and enhanced overall satisfaction and efficiency on the floor."
        },
        {
          "company": "FIRST SERVICE CONSULTING",
          "position": "Health Insurance Sales Agent",
          "period": "MAR 2020 - DEC 2020",
          "description": "• Sold personalized health insurance plans, handled customer objections, and used automated email marketing to improve lead conversion and client engagement."
        },
        {
          "company": "LOS PRODUCTORES",
          "position": "Host",
          "period": "FEB 2018 - JAN 2019",
          "description": "• Managed guest flow and safety in a busy hospitality environment while ensuring high customer satisfaction and operational order."
        }
      ],
      "discResult": "C+S",
      "discResultDescription": "Conscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.\\n\\nSteadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "90",
      "englishDescription": "Speaks fluently and confidently on a wide range of topics. Demonstrates strong command of vocabulary and idiomatic language. Pronunciation is clear and natural, with consistent grammatical accuracy and the ability to express complex ideas with ease.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "GonzaloProfile.jsx"
    },
    {
      "name": "GUILLERMO",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Guillermo.webp",
      "summary": "Virtual Assistant with a strong background in customer service, insurance policy management, and quality assurance. Guillermo brings over 5 years of experience in U.S. Property and Casualty insurance markets. His detail-oriented approach and adaptability make him a reliable partner for insurance providers and customer-centric businesses.",
      "tagline": "Guillermo is well-equipped to support insurance agencies, call centers, and administrative teams with bilingual virtual support rooted in empathy, precision, and professionalism.",
      "videoUrl": "https://www.youtube.com/embed/sLtVFyK2b7s",
      "skills": [
        "Customer Service",
        "Policy Quoting",
        "FNOl (First Notice of Loss) Processing",
        "Claims Follow-up",
        "Email & Calendar Management",
        "Policy Changes",
        "Customer Retention & Upselling",
        "Personal Lines Insurance",
        "Billing & Extensions",
        "Quality Assurance",
        "Document Handling"
      ],
      "tools": [
        "Insurance Carrier Portals",
        "Call Center Quality",
        "Monitoring Systems",
        "CRM Platforms",
        "Microsoft Office",
        "Zoom Workplace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "AUTOMOBILE CLUB OF SOUTHERN CALIFORNIA (AAA)",
          "position": "Senior Insurance Policy Management Group",
          "period": "DEC 2022 - JAN 2025",
          "description": "• Managed existing Property and casualty insurance policies including Auto, Home, Umbrella, Watercraft, Classic Car and Earthquake for Collisions and Comprehensive working with underwriting to ensure they follow guidelines\\n• Answer inbound calls from customers answering questions about coverage, making amendments to their policy and manage and resolve billing including extensions and payments\\n• FNOL agent filing new claims and answering questions about existing claims while setting up communication with their adjuster for all Insurance policies mentioned before\\n• Create leads offering other services to single product customers which were warm transferred to our sales dept."
        }
      ],
      "discResult": "C+D",
      "discResultDescription": "Conscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.\\n\\nDominance (D) - Proactive and goal-driven. D-type VAs take initiative, solve problems efficiently, and thrive in fast-paced environments.",
      "englishScore": "95",
      "englishDescription": "Communicates fluently and naturally with clear pronunciation and strong command of grammar. Uses a wide range of vocabulary and expressions to convey ideas accurately and confidently across various topics.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "GuillermoProfile.jsx"
    },
    {
      "name": "ISRAEL",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Israel.webp",
      "summary": "Israel is a detail-oriented and proactive Virtual Assistant with a strong foundation in customer service, administrative support, and talent acquisition. With over three years of experience in bilingual roles, he excels in communication, problem-solving, and workflow optimization. His expertise includes:",
      "tagline": "Israel ensures smooth operations and top-tier support. His adaptability and organizational skills make him a valuable asset to any team. Click here to learn more about him.",
      "videoUrl": "https://www.youtube.com/embed/aSLhEc15mN4",
      "skills": [
        "Patient Account Management",
        "Customer Service & Support",
        "Documentation Management",
        "Process Optimization",
        "Data Entry",
        "Insurance Verification & Compliance",
        "Administrative & HR Assistance",
        "Quality Assurance",
        "Talent Acquisition",
        "Recruitment Coordination",
        "Claims Processing"
      ],
      "tools": [
        "Salesforce",
        "Vonage",
        "Verbex",
        "Genesys",
        "Microsoft Office",
        "Google Workspace",
        "HIPAA Compliance"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "SWBC",
          "position": "Inbound Customer Service Representative",
          "period": "2024",
          "description": "• Provides support to financial institutions and insurance agents by managing auto and mortgage loan insurance coverage and identifying uninsured loans."
        },
        {
          "company": "DMF SERVICE SOLUTIONS",
          "position": "Talent Acquisition Coordinator",
          "period": "NOV 2021 - AUG 2022",
          "description": "• Managed bilingual recruitment, coordinated interviews, supported HR processes, and assisted with equipment and onboarding logistics for remote customer service teams."
        },
        {
          "company": "TELEPERFORMANCE",
          "position": "Medicare and Commercial Reorder Specialist",
          "period": "FEB 2020 - JUL 2021",
          "description": "• Supported U.S. patients by verifying health insurance, processing Medicare information, coordinating with pharmacies, and handling medical documentation for Dexcom CGM devices."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "6.5",
      "englishDescription": "Communicates clearly with good pronunciation. Demonstrates solid fluency and coherence with occasional pauses. Uses a varied vocabulary, including some idiomatic expressions, and conveys complex ideas with mostly accurate grammar and moderate level of flexibility.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "IsraelProfile.jsx"
    },
    {
      "name": "IVAN",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Ivan.webp",
      "summary": "Ivan is a Virtual Assistant with a strong foundation in medical interpretation and insurance documentation. He is known for his professionalism, loyalty, and eagerness to continually expand his skills to better serve clients.",
      "tagline": "Ivan is equipped to handle diverse administrative tasks for professionals who require multilingual, detail-focused support.",
      "videoUrl": "https://www.youtube.com/embed/dHojsDPmfHc",
      "skills": [
        "Auto Insurance Support",
        "Declaration Page Review",
        "Inbound & Outbound Calls",
        "Client Issue Resolution",
        "Insurance Claims Follow-ups",
        "Data Entry & CRM",
        "Medical Interpretation",
        "Policy Review & Adjustments",
        "Calendar & Email Management",
        "Cancellations & Endorsements",
        "Underwriting & Documentation"
      ],
      "tools": [
        "Google Suite",
        "Microsoft Office",
        "Zoom Workplace",
        "CRM",
        "MGA System",
        "Ring Central"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "PERU PROCESS SOLUTIONS",
          "position": "Legal and Insurance Office",
          "period": "OCT 2023 - JAN 2024",
          "description": "First Notice of Loss Department (Claims)\\n\\nUnderwriting Department\\nFEB 2024 - FEB 2025\\n• In both claims department and underwriting, having direct contact with brokers, and in charge of policies documentation."
        }
      ],
      "discResult": "C",
      "discResultDescription": "Conscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.",
      "englishScore": "100",
      "englishDescription": "Speaks fluently and clearly, using a wide range of vocabulary and natural expressions with ease. Pronunciation is smooth and intelligible, supported by strong command of grammar to convey complex ideas accurately.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "IvanProfile.jsx"
    },
    {
      "name": "JANET",
      "title": "ENGLISH-SPEAKING VA | CREDIT & INSURANCE SUPPORT",
      "image": "/images/VAs/Janet.webp",
      "summary": "Janet has nearly two years of experience in the banking sector as a Credit Underwriting Specialist and Virtual Assistant for compliance. She is skilled in reviewing and managing loan applications, coordinating with underwriters, and handling back-office insurance accounts. She brings strong expertise in data insurance accounts, handling endorsements, COIs, renewals, and coverage verification through AMS360.",
      "tagline": "Janet\\",
      "videoUrl": "https://www.youtube.com/embed/ifyF-owgkDw",
      "skills": [
        "Credit Underwriting",
        "Compliance",
        "Auto Insurance",
        "COIs",
        "Loan Review",
        "Fraud Verification",
        "Endorsements",
        "Renewals",
        "Mortgage Review",
        "Document Verification",
        "Home Insurance"
      ],
      "tools": [
        "Salesforce",
        "Avaya",
        "AMS 360",
        "Instinct",
        "Cisco Webex",
        "SPI",
        "ACSR",
        "Nuance",
        "Slack",
        "Microsoft Teams"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "HSBC DATA ELECTRONIC PROCESSING INC.",
          "position": "Credit Underwriting Specialist",
          "period": "MAR 2024 - 2025",
          "description": "• Responsible in assessing the credit risk of loan or policy applicants by analyzing financial statements, credit histories, and other documentation to determine creditworthiness.\\n• It includes verifying applicant information, performing risk assessments, ensuring compliance with credit policies and regulations, making recommendations on loan approvals or denials, and communicating findings to relevant parties."
        },
        {
          "company": "COVER DESK PHILIPPINES",
          "position": "Virtual Assistant",
          "period": "DEC 2022 - AUG 2023",
          "description": "• Reviewing policies and administrative tasks for an insurance agency including client communication claims follow up."
        },
        {
          "company": "AFNI PHILIPPINES",
          "position": "Chat Support Representative",
          "period": "JUN 2015 - OCT 2022",
          "description": "• Provides customer service, technical support, bill disputes, processing payments, device, data plan upgrade, adding or removing features, enrolling new customers, troubleshooting defective phones."
        },
        {
          "company": "CONVERGYS",
          "position": "Chat Support Representative",
          "period": "MAR 2014 - JUN 2015",
          "description": "• Provides assistance in billing, technical support and customer service to Comcast customers. Sends truck roll when troubleshooting via chat is not possible."
        },
        {
          "company": "SPI GLOBAL SOLUTIONS INC. (STRAIVE)",
          "position": "PDF Editor/XML Checker/QA Specialist",
          "period": "SEP 2003 - OCT 2008",
          "description": "• Responsible for Structuring the input raw file, quality check, parsing and validation, moving the file onto the next stage and forward to copy editors.\\n• Responsible to make error-free XML documents, validate XML against a DTD or a schema, and force to stick to a valid XML structure.\\n• Checking for things that can be checked manually, such as punctuation, capitalization, figures quality and proofread online contents and documents for factual and grammatical accuracy since the automated QA tool has already caught the technical issues, we focus on the actual transition and not a missing period, proper layout of figures and number of tags."
        },
        {
          "company": "SPI GLOBAL SOLUTIONS INC. (STRAIVE)",
          "position": "Content Support Specialist",
          "period": "OCT 2008 - JUL 2010",
          "description": "• Directly reporting to the Authors of the Journals by providing updates via email, coordinates and integrates the work of writers and designers to help produce a final layout compatible with corporate standards.\\n• Collects, produces, and edits website material to maintain and improve the quality of information provided."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "8.4/9",
      "englishDescription": "Demonstrates excellent fluency and clear pronunciation with natural pacing and tone. Uses advanced vocabulary and complex grammar structures with precision to express ideas confidently and effectively.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "JanetProfile.jsx"
    },
    {
      "name": "JANICE",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Janice.webp",
      "summary": "Janice is a highly skilled and detail-oriented Executive Virtual Assistant with over nine years of experience in leadership support, supervision and administrative support. With a strong background in real estate, corporate contracts, and supporting business leaders in making informed decisions, Janice has the ability to successfully manage the following tasks:",
      "tagline": "Janice is a proactive and organized professional, skilled in handling complex tasks with excellence. Click here to learn more about her.",
      "videoUrl": "https://www.youtube.com/embed/P8gcQHNJwsk",
      "skills": [
        "Customer Support",
        "Calendar Management",
        "Legal Document Review",
        "Project Coordination",
        "Business Operations",
        "E-commerce Management",
        "Data Reporting",
        "Contract Drafting",
        "Inventory & Invoice Management",
        "Shipment & Logistics Coordination",
        "Presentation Creation"
      ],
      "tools": [
        "Joor",
        "Canva",
        "Shopify",
        "Richpanel",
        "Microsoft Office",
        "Google Workspace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "OCEAN VIRTUAL ASSISTANT",
          "position": "Virtual Assistant/Executive Assistant",
          "period": "AUG 2023 - PRESENT",
          "description": "• Supports the CEO with daily executive tasks, including calendar and email management, inventory tracking, report creation, and coordination of garment shipments."
        },
        {
          "company": "SM DEVELOPMENT CORPORATION",
          "position": "Legal Supervisor",
          "period": "JUL 2013 - APR 2023",
          "description": "• Provided legal and administrative support by drafting and reviewing contracts, managing legal documentation for real estate transactions, assisting with civil case filings, and handling client inquiries."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "7.6",
      "englishDescription": "Communicates fluently and confidently with clear pronunciation, a rich vocabulary, and strong grammar.",
      "education": {
        "school": "Technological University of the Philippines",
        "degree": "BS Entrepreneurial Management",
        "date": "2009 - 2013"
      },
      "sourceFile": "JaniceProfile.jsx"
    },
    {
      "name": "JASMINE",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Jasmine.webp",
      "summary": "English speaking virtual assistant with extensive experience in customer service, administrative support, marketing, and real estate assistance. Jasmine is highly adaptable, detail-oriented and excels at managing multiple tasks efficiently. Jasmine is ready to start immediately and can assist with the following tasks:",
      "tagline": "Jasmine is excited to collaborate and bring her skills to your team. Want to learn more? Click here to watch her video and see how she can help!",
      "videoUrl": "https://www.youtube.com/embed/WhdFCM1GABs",
      "skills": [
        "Reception & Customer Support",
        "Graphic Design",
        "Email Marketing",
        "Guest Reservations Monitoring",
        "Meeting Scheduling",
        "Calendar Management",
        "Property Management",
        "Property Maintenance Coordination",
        "Documents Organization",
        "Social Media Management",
        "Guest Check-in/Check-out Management"
      ],
      "tools": [
        "CRM",
        "Zoho",
        "Zendesk",
        "Canva",
        "Buzzsprout",
        "Instagram & Facebook Ads",
        "Microsoft Office",
        "Google Suite"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "SPHERE ROCKET VA",
          "position": "General Real Estate VA",
          "period": "JUL 2023 - OCT 2023",
          "description": "• Full time customer service representative with health insurance in the US.\\n• Addresses inquiries and understands coverage, benefits, and claim status.\\n• Assists customers with enrollment and ensures data protection compliance.\\n• Investigate and resolve customer complaints and claim denials in a timely manner."
        },
        {
          "company": "OUTSOURCED DOERS",
          "position": "Digital Marketing Virtual Assistant",
          "period": "SEP 2022 - JAN 2023",
          "description": "• Create weekly email newsletters and email campaigns.\\n• Promoting weekly podcast episodes through sending emails to subscribers.\\n• Posting and managing social media accounts (Facebook and Instagram).\\n• Create graphical designs for all social media posts and email weekly newsletters.\\n• Edit audios, inserting intros and outros for the podcast episode.\\n• Release weekly podcast episodes on Buzzsprout and all major podcast platforms."
        },
        {
          "company": "LTS MALLS, INC.",
          "position": "Marketing Assistant",
          "period": "OCT 2014 - AUG 2016",
          "description": "• Conceptualize and implement seasonal events and promotions for NCCC Mall Davao to increase foot traffic.\\n• Oversee the distribution and installation of marketing materials for events and new tenants.\\n• Ensuring the participation of mall tenants for all mall wide events.\\n• Create linkages with private and government institutions."
        },
        {
          "company": "LTS MALLS, INC.",
          "position": "Administrative Assistant",
          "period": "SEP 2013 - SEP 2014",
          "description": "• Receptionist of NCCC Mall Davao Administration Office.\\n• Set accurate appointments between tenants and Mall Administration Officers.\\n• Cater to mall customer complaints.\\n• Proper documentation and filing of Mall Administration files."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "6.4",
      "englishDescription": "Communicates clearly with reasonable fluency and coherence. Pronunciation is easily understood. Uses a good vocabulary and grammar structures with flexibility, effectively expressing ideas.",
      "education": {
        "school": "Davao Doctors College, Inc.",
        "degree": "BS Hospitality Management - Dean\\",
        "date": "APRIL 2011"
      },
      "sourceFile": "JasmineProfile.jsx"
    },
    {
      "name": "JAVIER",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Javier.webp",
      "summary": "Javier is a detail-oriented and bilingual Virtual Assistant with a unique blend of experience in insurance claims, customer service, and HSE compliance within the automotive and chemical industries. With a strong foundation in legal and safety standards, Javier excels at managing complex processes like:",
      "tagline": "Javier is a versatile VA prepared to support insurance agencies, safety teams, and administrative departments with a process-driven mindset.",
      "videoUrl": "https://www.youtube.com/embed/UCqesVIO_7M",
      "skills": [
        "Auto Claims Adjustment",
        "Policyholder Communication",
        "Audits & Corrective Actions",
        "Root Cause Analysis (RCA)",
        "Legal Compliance",
        "Productivity Tracking",
        "HSE Management",
        "Technical Documentation",
        "Roadside Assistance",
        "Certified DOT Safety Training"
      ],
      "tools": [
        "Aspen",
        "Remote Call",
        "Case Handling Platforms",
        "Solidworks",
        "Microsoft 365",
        "Advanced Excel"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "FAURECIA (FORVIA) - INJECTION MOLDING PLANT",
          "position": "HSE Specialist",
          "period": "2021 - 2022",
          "description": "• Coordinated internal audits and recertification processes (Clean Industry - PROFEPA).\\n• Implemented corrective actions in compliance with ISO 9001, ISO 14001, ISO 45001, and NOMIMX standards, achieving Clean Industry recertification.\\n• Led bilingual health and safety campaigns, promoting a risk prevention culture that contributed to a 50+ reduction in workplace accidents during my tenure.\\n• Supervised the handling and storage of urban, biohazardous, and hazardous waste.\\n• Managed PPE, COVID-19 prevention protocols, and delivered certified training (DC3).\\n• Designed and executed a comprehensive ergonomic study of workstations (lighting analysis, postural risk evaluation)"
        },
        {
          "company": "NATION SAFE DRIVERS",
          "position": "Bilingual Customer Service - Roadside Assistance & Towing",
          "period": "2022 - 2023",
          "description": "• Provided remote bilingual support to insurance clients (Farmers, Progressive, Allstate, Chubb).\\n• Coordinated with service providers to deliver prompt solutions during roadside emergencies.\\n• Handled confidential information in compliance with quality and security protocols."
        },
        {
          "company": "THE GENERAL INSURANCE",
          "position": "Auto Claims Adjuster",
          "period": "2024 - 2025",
          "description": "• Assessed vehicle damage and performed root cause and loss analysis for auto claims.\\n• Ensured legal and regulatory compliance throughout the claims process.\\n• Recognized for high performance and adaptability, achieving a 25% productivity improvement within a 3-month period"
        }
      ],
      "discResult": "S+I",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nInfluence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "95",
      "englishDescription": "Communicates fluently and naturally with clear pronunciation and strong command of grammar. Uses a wide range of vocabulary and expressions to convey ideas accurately and confidently across various topics.",
      "education": {
        "school": "Universidad Autónoma Popular del Estado de Puebla",
        "degree": "Not specified",
        "date": "2016 - 2022"
      },
      "sourceFile": "JavierProfile.jsx"
    },
    {
      "name": "JAY ALVIN",
      "title": "INSURANCE VA | COMMERCIAL & PERSONAL LINES",
      "image": "/images/VAs/Jay Alvin.webp",
      "summary": "With over three years in the U.S. insurance industry, Jay Alvin has supported agencies across personal and commercial lines. He is skilled in managing quoting, renewals, billing, and COIs, using his background in workload management and client coordination to deliver dependable, results-oriented support.",
      "tagline": "Jay brings over 15 years of BPO leadership and 3 years of U.S. insurance support, combining strong operational discipline, technical expertise, and hands-on policy servicing to deliver consistent results for agencies and brokers nationwide.",
      "videoUrl": "https://www.youtube.com/embed/GUe3uCkW8-4",
      "skills": [
        "Premium Audits & Billing",
        "Policy Servicing",
        "Property Manager Updates for Renters and Dwellings",
        "Client Relationship Management",
        "Certificates of Insurance (COIs) & Binders",
        "Billing Payments & Reinstatements",
        "Quoting, Renewals & Endorsements",
        "Team Leadership & Task Delegation",
        "Personal and Commercial Lines Servicing"
      ],
      "tools": [
        "AMS360",
        "Ezlynx",
        "Ringcentral",
        "Dialpad",
        "Multiple Carrier Platforms"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "PATRIOT INSURANCE - U.S BASED",
          "position": "Virtual Assistant",
          "period": "2023 - 2024",
          "description": "• Team Leader / Insurance VA\\n• Insurance account for personal and commercial lines\\n• Quoting and Service works\\n• Managing task and workload distribution for the team"
        },
        {
          "company": "ATKINSON INSURANCE GROUPE - OR, USA",
          "position": "Freelance Virtual Assistant",
          "period": "2020 - 2022",
          "description": "• Team manager - Handling 8 associates\\n• Insurance account for personal lines\\n• Managing workload distribution, basis policy changes, Binders, Billing, Payment and Cancellation.\\n• Using Ezlynx also familiar with most of the carriers mortgagee system."
        },
        {
          "company": "AFNI PHIL INC.",
          "position": "Inbound Sales Team Leader",
          "period": "2016 - 2020",
          "description": "• Inbound Sales Team leader handling 15-20 agents\\n• Satellite radio subscription\\n• Handling Sale for SiriusXM Satellite radio - US Account\\n• Inbound Sales and Retention Department."
        },
        {
          "company": "WNS INC.",
          "position": "Team Leader",
          "period": "2014 - 2016",
          "description": "• Team leader handling 20 agents - Global account\\n• Travel account - Vacation packages\\n• Inside sale Bookings for Airline, Car rental, Hotel and Cruise\\n• Accounts are Expedia and Travelocity\\n• GDS system is Altheo"
        },
        {
          "company": "PCCW TELESERVICES",
          "position": "Team Leader",
          "period": "2012 - 2014",
          "description": "• Team leader handling 15-20 agents - Global account\\n• Airlines - Travel account International\\n• Inside sale for Booking, Ticking and Redemption\\n• GDS System are Altheo and Amadeus"
        },
        {
          "company": "UNIVERSAL GENESIS BPO",
          "position": "Outbound/Inbound Sales Agent",
          "period": "2008 - 2012",
          "description": "• Outbound/Inbound Sales Agent - US Account\\n• B2B and B2C Campaign\\n• Lead generation\\n• Telemarketer"
        }
      ],
      "discResult": "S+I",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nInfluence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "75",
      "englishDescription": "Shows good communication skills with clear pronunciation and steady fluency. Uses everyday vocabulary and grammar effectively.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "JayAlvinProfile.jsx"
    },
    {
      "name": "JEROME",
      "title": "ENGLISH-SPEAKING VA | INSURANCE SPECIALIST",
      "image": "/images/VAs/Jerome.webp",
      "summary": "Jerome is an Insurance Virtual Assistant with experience in home and auto insurance. He manages quoting, policy servicing, endorsements, renewals, and MVR reports. Skilled in coordinating with clients, underwriters, and carriers, he maintains smooth operations through proactive communication and attention to detail. His previous five years in customer service enhanced his ability to handle complex client interactions effectively.",
      "tagline": "Jerome combines technical precision with a service-oriented mindset—ensuring policy accuracy, timely updates, and seamless coordination across clients, underwriters, and carriers. His mix of analytical and interpersonal skills makes him a dependable asset for any insurance team.",
      "videoUrl": "https://www.youtube.com/embed/aomGUtRlOiE",
      "skills": [
        "Customer Service",
        "Policy Servicing",
        "Client Communication",
        "Billing",
        "Payments Verification",
        "Endorsements",
        "MVR Reports",
        "Coverage Review",
        "Renewals",
        "Quoting",
        "Underwriter Coordination",
        "Claims Follow-up"
      ],
      "tools": [
        "HawkSoft",
        "Ezlynx",
        "Asana",
        "AgentX",
        "Slack",
        "Nice CXone",
        "Avaya One-X",
        "Microsoft Teams",
        "Microsoft Outlook"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "INDEPENDENT CONTRACT",
          "position": "General Virtual Assistant - Home & Auto Insurance Agency",
          "period": "JAN 2025 - 2025",
          "description": "• Managed end-to-end policy servicing for Home and Auto insurance clients, including quoting, policy amendments, and client updates.\\n• Generated and revised insurance quotes based on client coverage needs and eligibility criteria.\\n• Processed Auto policy updates, including adding loss payees, removing vehicles, and modifying coverage limits and deductibles.\\n• Updated Home insurance coverage categories such as Dwelling, Liability, and Personal Belongings.\\n• Ran MVR (Motor Vehicle Records) reports to evaluate driver risk profiles.\\n• Drafted and sent professional communications to insurance carriers (underwriters and service departments).\\n• Utilized multiple insurance platforms and carrier tools, including: HawkSoft, Mercury, Safeco, GEICO, Progressive, Acuity, Nationwide, Dairyland, and Travelers."
        },
        {
          "company": "ALORICA",
          "position": "Customer Service Representative",
          "period": "2020 - 2025",
          "description": "• Supported customers with Home Internet-related issues, including billing inquiries, technical troubleshooting, and account updates.\\n• Resolved online account access and billing disputes with professionalism and accuracy.\\n• Assisted guests with hotel reservations, ensuring prompt resolution of booking issues.\\n• Served as Mentor for new hires and Associate Coach, supporting call escalations and agent performance."
        },
        {
          "company": "TELEPERFORMANCE",
          "position": "Customer Service Representative",
          "period": "2018 - 2020",
          "description": "• Assisted healthcare customers with insurance claims, benefits, and eligibility concerns.\\n• Supported clients in Primary Care Physician changes and technical account troubleshooting.\\n• Handled AT&T account inquiries, including billing and Fox channel access issues.\\n• Recognized for exceptional performance, reliability, and customer satisfaction scores."
        }
      ],
      "discResult": "S+I",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nInfluence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "90",
      "englishDescription": "Speaks clearly and fluently with natural pronunciation and confident delivery. Demonstrates strong command of advanced vocabulary and grammar, effectively expressing complex and nuanced ideas.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "JeromeProfile.jsx"
    },
    {
      "name": "JILL NICOLE",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Jill.webp",
      "summary": "Tech savvy Virtual Assistant with strong computer literacy, specializing in customer service, time management, and administrative support. Excited and ready to start handling tasks such as:",
      "tagline": "Jill can begin working with you right away! Want to learn more about her skills and experience? Click here to watch her video and see how she can help.",
      "videoUrl": "https://www.youtube.com/embed/7yREE7oxSu0",
      "skills": [
        "Data Entry",
        "Review Data for Accuracy",
        "Training Coordination",
        "CRM",
        "Managing Calendar and Setup Meetings",
        "Workforce Analytics",
        "Staff Scheduling",
        "Social Media Management",
        "Timekeeping",
        "Reporting and Analyzing Data",
        "Inbound & Outbound Calls",
        "Email Management",
        "Customer Support"
      ],
      "tools": [
        "Google Workspace",
        "Microsoft Office",
        "Workforce Optimization Systems",
        "Zendesk",
        "Zoho"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "MAJOREL/TP",
          "position": "WFM Scheduling Analyst",
          "period": "FEB 2023 - FEB 2024",
          "description": "• Responsible to create/optimize schedules and maximize efficient utilization of resources through schedules that have been released/created in the most cost effective way i.e. holidays, voluntary time-offs, break planning.\\n• Workforce Management Tool optimization, proactively ensuring sufficient coverage at all times to deliver contractual requirements consistently."
        },
        {
          "company": "MAJOREL/TP",
          "position": "WFM Real Time Analyst",
          "period": "JUN 2022 - FEB 2023",
          "description": "• Our responsibility is to monitor agent activities by monitoring their attendance, queues, and adherence.\\n• Sending an hourly, end of week and end of month reports for Operations visibility.\\n• Attending meetings with Clients discussing the performance of the account"
        },
        {
          "company": "MAJOREL/TP",
          "position": "Content Moderator",
          "period": "APR 2018 - JUN 2022",
          "description": "• We review and monitor user-generated content to look for messages and content that go against policy and/or community guidelines."
        },
        {
          "company": "IQOR",
          "position": "Sales Agent/CSR",
          "period": "NOV 2017 - MAR 2018",
          "description": "• Handled incoming calls for customers who wants to place an order and helping them on tracking their replacement or any order concerns.\\n• Offering Ad-Ons like products related to what they ordered"
        },
        {
          "company": "SUTHERLAND",
          "position": "Customer Service Representative",
          "period": "NOV 2016 - MAR 2017",
          "description": "• Supporting Amazon retail customers by taking inbound calls, outbound calls, and chat.\\n• Processing and tracking of orders either new one, returns and replacements."
        }
      ],
      "discResult": "S+I",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nInfluence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "6.2",
      "englishDescription": "Speaks clearly with generally good fluency. Uses a varied vocabulary and idiomatic expressions. Grammar is solid, with a mix of simple and complex structures. At times, may pause while formulating thoughts, but overall communication remains clear.",
      "education": {
        "school": "AMA Computer Learning Center",
        "degree": "Business and Office Administration Services",
        "date": "2012 - 2015"
      },
      "sourceFile": "JillNicoleProfile.jsx"
    },
    {
      "name": "JIMMY",
      "title": "INSURANCE VIRTUAL ASSISTANT",
      "image": "/images/VAs/Jimmy.webp",
      "summary": "Jimmy is a skilled Virtual Assistant with over 10 years of experience in insurance support, customer service, collections and account management. His background in both insurance and finance-related services makes him a versatile professional who can provide support to agencies, call centers, and service-based businesses.",
      "tagline": "Jimmy is the ideal Virtual Assistant for insurance agencies, seeking a customer-focused, detail-oriented professional with proven experience in insurance operations.",
      "videoUrl": "https://www.youtube.com/embed/rKDnjVB-dxE",
      "skills": [
        "Account Assistance",
        "Insurance Policy Review",
        "Quoting",
        "Escalation Management",
        "Customer Service",
        "Complaint Resolution",
        "Team Supervision",
        "Claims Support",
        "Coverage Assistance",
        "Policyholder Communication",
        "Billing Dispute Resolution"
      ],
      "tools": [
        "Insurance Carrier Systems",
        "Quoting Tools",
        "Microsoft Office",
        "CRM",
        "Web-Based Customer Support Tools"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "COGNIZANT TECHNOLOGY SOLUTIONS",
          "position": "Senior Process Executive",
          "period": "FEB 6, 2023 - JAN 6, 2025",
          "description": "• Handled insurance policy analysis, customer inquiries, agent support, and complaint resolution for personal insurance accounts with a focus on service quality."
        },
        {
          "company": "TATA CONSULTANCY SERVICES",
          "position": "Senior Process Associate",
          "period": "MAR 2019 - FEB 6, 2023",
          "description": "• Provided customer service by managing inquiries, complaints, account validations, and ensuring procedural compliance to enhance customer satisfaction."
        },
        {
          "company": "WNS GLOBAL SERVICES",
          "position": "Senior Credit Associate",
          "period": "MAY 2014 - DEC 2016",
          "description": "• Led outbound collections and account reconciliations, managed overdue debts, and ensured compliance with policies while mitigating high-risk accounts."
        },
        {
          "company": "VCUSTOMER TECHMAHINDRA PHILS",
          "position": "Customer Service Representative",
          "period": "OCTOBER 2013",
          "description": "• Delivered professional customer support for inquiries and complaints, escalating unresolved issues and contributing to team training efforts."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "7.4/9",
      "englishDescription": "Demonstrates clear and fluent communication with natural pronunciation and minimal pauses. Uses advanced vocabulary and complex grammar structures effectively to express nuanced ideas.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "JimmyProfile.jsx"
    },
    {
      "name": "JOANA",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Joana.webp",
      "summary": "Reliable Virtual Assistant with hands-on experience in administrative support, customer interaction, and digital communication. With strong bilingual communication skills and a proactive approach, Joana confidently manages responsibilities such as:",
      "tagline": "Joana delivers high-quality support that allows busy professionals to stay focused on growth.",
      "videoUrl": "https://www.youtube.com/embed/PrZ7xZryyjQ",
      "skills": [
        "Social Media Management",
        "Online Research & Report Preparation",
        "Invoice Generation",
        "Insurance Policy Guidance",
        "Travel Planning & Booking",
        "Files Organization",
        "Data Entry",
        "Calendar & Email Management",
        "Inbound & Outbound Calls",
        "Content Creation"
      ],
      "tools": [
        "CRMs",
        "Canva",
        "Cloud Storage Platform",
        "Google Suite",
        "Microsoft Office",
        "Zoom Workplace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "OCEAN VA SOLUTIONS",
          "position": "Virtual Assistant",
          "period": "JUL 2024 - MAY 2025",
          "description": "• Supported insurance agents by handling policy documentation, client onboarding, scheduling, inbox monitoring, and reporting to ensure timely and accurate insurance processing."
        },
        {
          "company": "TTEC",
          "position": "Operations Manager",
          "period": "2021 - 2024",
          "description": "• Oversaw business operations by monitoring production, handling payroll and timecards, implementing efficiency strategies, and ensuring quality control."
        },
        {
          "company": "PODER JUDICIAL TERCERO PENAL",
          "position": "Administrative Assistant",
          "period": "2019 - 2021",
          "description": "• Provided public-facing administrative support by drafting and digitizing documents, managing calls and mail, and attending court hearings weekly."
        },
        {
          "company": "LISTEN TRUST",
          "position": "Supervisor",
          "period": "2016 - 2019",
          "description": "• Led the Customer Service Division by training staff, managing performance, overseeing operations, and contributing to budget preparation."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "6.6",
      "englishDescription": "Speaks with reasonable fluency and clarity, using a variety of connectives and grammar structures to express ideas. Pronunciation is clear and easy to understand, and vocabulary is generally effective for discussion across topics.",
      "education": {
        "school": "Universidad Interamericana para el Desarrollo",
        "degree": "Law Degree",
        "date": "2016 - 2019"
      },
      "sourceFile": "JoanaProfile.jsx"
    },
    {
      "name": "JOEL",
      "title": "ENGLISH-SPEAKING VA | INSURANCE",
      "image": "/images/VAs/Joel.webp",
      "summary": "Joel has over 6 years of experience in the insurance industry, handling both personal lines and commercial lines. He has performed quoting, endorsements, certificates of insurance, renewals, cancellations, and quality checks. Joel brings a detail-oriented, client-focused approach to insurance underwriting support and back-office operations, ensuring accuracy and reliability in every task.",
      "tagline": "Joel combines his strong analytical and organizational skills with a solid insurance background, making him a reliable professional ready to support clients with accuracy, professionalism, and efficiency.",
      "videoUrl": "https://www.youtube.com/embed/5n99ZiMc0fs",
      "skills": [
        "Executive Support",
        "Content Creation",
        "Workflow Optimization with AI Tools",
        "Event Planning",
        "Calendar Management",
        "Marketing Campaign Coordination",
        "Contract Handling",
        "Expense Reporting",
        "Social Media Management",
        "Travel Arrangements",
        "Vendor Coordination",
        "Budget Tracking"
      ],
      "tools": [
        "Slack",
        "Salesforce",
        "CRM Systems",
        "Notion",
        "Asana",
        "Atlassian",
        "Quickbooks",
        "Canva",
        "Wordpress",
        "Microsoft Office"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "BIG INSURANCE",
          "position": "Insurance VA - Personal Lines Portfolio Underwriter",
          "period": "SEPT 2024 - MAY 2025",
          "description": "• Ensuring the accuracy and completeness of insurance policies. This involves tasks like verifying information, processing policy applications, issuing policies, and resolving discrepancies."
        },
        {
          "company": "SWAK BPO - CLARKFIELD, PAMPANGA",
          "position": "Data Processing Representative (Policy Processor)",
          "period": "OCT 2021 - AUG 2024",
          "description": "• Worked as a Data Processing Representative, managing policy endorsements, cancellations, renewals, and client communication for insurance documentation."
        },
        {
          "company": "TASKUS",
          "position": "Data Analyst / Quality Analyst",
          "period": "NOV 2017 - JUN 2020",
          "description": "• Held the role of Data Analyst/Quality Analyst, supporting data-driven operations and ensuring quality standards in a fast-paced customer service environment."
        }
      ],
      "discResult": "I",
      "discResultDescription": "Influence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "7.9",
      "englishDescription": "Speaks fluently with clear pronunciation and minimal accent, maintaining coherence throughout. Uses a wide range of vocabulary and grammar flexibly to express complex ideas with confidence.",
      "education": {
        "school": "Holy Angel University",
        "degree": "Bachelor of Science in Hotel and Restaurant Management",
        "date": "BATCH 2013"
      },
      "sourceFile": "JoelProfile.jsx"
    },
    {
      "name": "JOJI MARIE",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Joji Marie.webp",
      "summary": "Virtual Assistant with robust experience in the insurance industry, customer service, and administrative support. She excels at streamlining processes, managing data entry, and supporting client relationships through clear communication and precision. She brings to the table reliability and commitment to efficiency in every task.",
      "tagline": "Joji is fully equipped to support insurance professionals, customer-facing teams, and business owners, delivering dependable service marked by adaptability, organization, and attention to detail.",
      "videoUrl": "https://www.youtube.com/embed/5N_z80i4KrQ?t=1s",
      "skills": [
        "Customer Service",
        "Email & Calendar Management",
        "Personal & Commercial Insurance",
        "Data Entry",
        "Mortgage Updates",
        "ACORD Forms",
        "Quote Generation",
        "COI Downloads",
        "Proposal Creation",
        "Endorsements",
        "Policy Renewals",
        "Af-Fueled Epic CRM",
        "Policy Documentation",
        "Accounting Tasks"
      ],
      "tools": [
        "Applied Epic",
        "Zendesk",
        "Salesforce",
        "Google Workspace",
        "Microsoft Office"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "INSURANCE COMPANY",
          "position": "Administrative Assistant",
          "period": "APRIL 2023 - FEB 2025",
          "description": "• Adding prospect to APPLIED EPIC\\n• Downloading ACORDS, COI Etc.\\n• Updating Insurance Mortgage\\n• Communicating with carriers and insured\\n• Creating Activity to Applied EPIC\\n• Assisting account manager"
        },
        {
          "company": "INSURANCE COMPANY",
          "position": "Administrative Assistant",
          "period": "JAN 2021 - APRIL 2023",
          "description": "• Data Entry\\n• Creating proposal\\n• Accounting task\\n• Reconciliation\\n• Checking balances"
        },
        {
          "company": "TELECOMMUNICATION SERVICES",
          "position": "Customer Support Representative",
          "period": "MAY 2020 - JAN 2021",
          "description": "• Set up devices\\n• Troubleshoot\\n• Provide current new services\\n• Answer billing inquiries"
        },
        {
          "company": "TELECOMMUNICATION SERVICES",
          "position": "Technical Support Representative",
          "period": "SEPT 2019 - APR 2020",
          "description": "• Set up devices\\n• Troubleshoot\\n• Set up a schedule for a tech visit"
        },
        {
          "company": "HOME WARRANTY",
          "position": "Customer Service Representative",
          "period": "AUG 2018 - SEPT 2019",
          "description": "• Provide details to the customer\\n• Contacting contractor for maintenance\\n• Setting up schedule"
        },
        {
          "company": "TELECOMMUNICATION SERVICES",
          "position": "Data Entry Specialist",
          "period": "FEB 2014 - AUG 2018",
          "description": "• Add customer device into the system\\n• Make sure the line is active\\n• Correcting error\\n• Input customer information into the system"
        }
      ],
      "discResult": "S+C",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nConscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.",
      "englishScore": "70",
      "englishDescription": "Communicates confidently on familiar topics with clear pronunciation and well-structured speech. Uses basic grammar and vocabulary effectively to express thoughts and maintain conversations.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "JojiMarieProfile.jsx"
    },
    {
      "name": "KAREN",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Karen.webp",
      "summary": "Dedicated and highly trained Insurance Virtual Assistant with experience supporting U.S.-based insurance organizations and executive assistance taking calls with a track record of exceeding performance expectations. She has demonstrated ability to manage the following core competencies:",
      "tagline": "Karen is committed to delivering accurate, detail-oriented virtual support tailored to the needs of insurance operations and client service workflows.",
      "videoUrl": "https://www.youtube.com/embed/TXb9ONnF310",
      "skills": [
        "Appraisal-Coordination",
        "Appointment Setting",
        "US Insurance Regulations (FL & TX)",
        "Quotation Handling",
        "Insurance Documentation Review & Prep",
        "Home-Risk Evaluations",
        "Homeowners, Umbrella & Dwelling Insurance",
        "Customer Service",
        "Inbound & Outbound Calls",
        "Email & Calendar",
        "Policy Coverage & Renewals"
      ],
      "tools": [
        "Salesforce",
        "Hubspot",
        "Slack",
        "Google Workspace",
        "Zoom Workplace",
        "Microsoft Office Suite"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "NWPMC HOMES & REMODELS",
          "position": "Virtual Assistant | Assistant Manager",
          "period": "JAN 2022 - JAN 2025",
          "description": "• Managed company schedules, ensuring seamless appointment setting. Provided top-tier customer service, including email follow-ups, responding to inquiries, and sending quotes.\\n• Coordinated meetings with providers, monitored project timelines, and maintained customer satisfaction.\\n• Promoted within 3 months from Appointment Setter to Assistant Manager due to exceptional performance."
        },
        {
          "company": "FARMERS INSURANCE",
          "position": "Inside Sales Agent | Appointment Setter",
          "period": "MAY 2021 - AUG 2022",
          "description": "• Conducted 100-120 outbound calls daily to cold, warm, and referral leads, qualifying them for insurance products.\\n• Consistently set 40-50 appointments per month, contributing to the growth of the business."
        },
        {
          "company": "LANGUAGE LINE SOLUTIONS",
          "position": "Appointment Setter",
          "period": "DEC 2020 - AUG 2021",
          "description": "• Focused on cold calling, lead generation, and scheduling appointments to maximize office calendar efficiency.\\n• Generated leads for future follow-up and maintained regular client interaction for successful conversion."
        },
        {
          "company": "GOOD NEIGHBOR PODCASTS",
          "position": "Bilingual Customer Support Representative",
          "period": "JAN 2021 - JAN 2022",
          "description": "• Provided on-demand bilingual interpretation between Spanish and English speakers across various industries."
        },
        {
          "company": "ESTACION MEXICO",
          "position": "Tour Guide and Hostess",
          "period": "MAR 2018 - JAN 2021",
          "description": "• Led groups of tourists on educational and engaging tours, providing in-depth information on historical, cultural, and local landmarks.\\n• Adapted tours based on client needs and preferences, ensuring a unique and tailored experience for diverse audiences."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "85/B2",
      "englishDescription": "Speaks confidently with clear pronunciation and well-structured, fluent speech. Uses a broad range of vocabulary and grammar to express ideas effectively in both casual and professional contexts.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "KarenProfile.jsx"
    },
    {
      "name": "KEVIN",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Kevin.webp",
      "summary": "Kevin is a highly skilled and adaptable Virtual Assistant with a strong background in customer service, data management, and digital marketing. With years of experience across multiple industries, Kevin brings technical proficiency and leadership to every role. His expertise includes:",
      "tagline": "Kevin\\",
      "videoUrl": "https://www.youtube.com/embed/MnlRVthsUYE",
      "skills": [
        "Process Optimization",
        "Data Analysis",
        "Content Creation",
        "Team Supervision",
        "Social Media Management",
        "Advertising",
        "Video Editing",
        "Customer Service",
        "Account Management",
        "Quality Assurance"
      ],
      "tools": [
        "Celigo",
        "Netsuite",
        "Adobe Suite",
        "Advanced Excel",
        "AI Labschool",
        "Microsoft Office",
        "Lightwave 3D",
        "Animation",
        "CRM & Workflow Automation"
      ],
      "equipment": [
        "Three-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "INFINITECH (ORDER HERO, ORDER VENTURE)",
          "position": "Supervisor",
          "period": "2017 - 2020",
          "description": "• Managed customer service teams, ensuring goal achievement and efficient data organization.\\n• Developed tools for automation and improved customer tracking.\\n• Managed Excel pipelines to evaluate performance and order conversion."
        },
        {
          "company": "AESBUS",
          "position": "Quality Assurance Assistant",
          "period": "2020 - 2022",
          "description": "• Assessed agent performance in customer interactions.\\n• Provided coaching and training to optimize communication and results.\\n• Used advanced Excel for trend and performance analysis."
        },
        {
          "company": "CCSI KBS",
          "position": "Cash Apps & Account Management",
          "period": "2022 - 2025",
          "description": "• Evaluated and improved processes in account and payment management.\\n• Advised and trained teams to optimize call flow.\\n• Conducted data analysis to enhance team performance."
        },
        {
          "company": "FREELANCE DIGITAL MARKETING",
          "position": "Digital Marketing Specialist",
          "period": "2017 - PRESENT",
          "description": "• Created and managed advertising campaigns on Meta.\\n• Produced and edited audiovisual content for social media.\\n• Developed growth and positioning strategies for digital platforms."
        }
      ],
      "discResult": "C+S",
      "discResultDescription": "Conscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.\\n\\nSteadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "8",
      "englishDescription": "Speaks fluently with clear pronunciation. Uses a broad vocabulary, including idiomatic expressions, with strong grammatical accuracy. Communicates ideas coherently, developing topics effectively with smooth transitions.",
      "education": {
        "school": "Autonomous University of Baja California / Instituto Altazor",
        "degree": "Nanotechnology Engineering / Honor Student with Training in Basic Excel, Photoshop, Programming, 3D Animation, and Video Editing",
        "date": "2020 - 2022 (On Hold, Sabbatical) / 2014 - 2017"
      },
      "sourceFile": "KevinProfile.jsx"
    },
    {
      "name": "LAURICE",
      "title": "INSURANCE VIRTUAL ASSISTANT | HOME INSURANCE",
      "image": "/images/VAs/Laurice.webp",
      "summary": "Laurice is an Insurance Virtual Assistant and Closer supporting U.S.-based agencies. She specializes in home insurance quoting, renewals, and policy management, ensuring full compliance with underwriting guidelines. Laurice updates policies, manages client pipelines, and reviews premiums to maintain competitive rates. She delivers accurate, efficient, and client-focused insurance support.",
      "tagline": "Laurice distinguishes herself through her precision, dependability, and commitment to client-centered service. Her keen attention to detail, combined with proactive and thoughtful communication, allows her to consistently provide high-quality support that drives operational efficiency and strengthens overall client satisfaction.",
      "videoUrl": "https://www.youtube.com/embed/9cz71wjqIX8",
      "skills": [
        "Renewals",
        "Underwriting Compliance",
        "Client Pipeline",
        "Data Accuracy",
        "Customer Communication",
        "Deductibles",
        "Lead Management",
        "Quoting",
        "Policy Updates",
        "Endorsement",
        "Property Verification",
        "Email Support"
      ],
      "tools": [
        "Quoush",
        "Ezlynx",
        "InsuredMine",
        "Salesforce",
        "Microsoft 365",
        "Google Workspace",
        "Zoom Workplace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "COVERDESK",
          "position": "Virtual Assistant",
          "period": "MAY 2024 - SEPT 2025",
          "description": "• 1 year of experience as a Virtual Assistant in CoverDesk, handling home insurance.\\n• Specialized in quoting homes and requested home insurance coverage."
        }
      ],
      "discResult": "S+C",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nConscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.",
      "englishScore": "8.4/9",
      "englishDescription": "Demonstrates fluent and natural communication with clear pronunciation and minimal pauses. Uses advanced vocabulary and complex grammar accurately to convey nuanced and well-structured ideas.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "LauriceProfile.jsx"
    },
    {
      "name": "LOIS",
      "title": "VIRTUAL ASSISTANT | INSURANCE",
      "image": "/images/VAs/Lois.webp",
      "summary": "Lois is an experienced Virtual Assistant with a strong background in insurance operations, customer service, and client retention. She has supported multiple U.S.-based insurance firms. With over 5 years of VA and insurance experience, Lois brings proven expertise in policy servicing, client relationship management, combined with excellent communication skills and a strong work ethic.",
      "tagline": "Lois is the ideal Virtual Assistant for insurance agencies and service-based organizations seeking a skilled, detail-oriented professional.",
      "videoUrl": "https://www.youtube.com/embed/HSCzM1jVsaE",
      "skills": [
        "Billing Inquiries",
        "Customer Relationship Management",
        "Inbound/Outbound Calls",
        "Coverage Updates",
        "Quoting & Policy Servicing",
        "Payment Follow-ups",
        "Lead Research",
        "Personal & Commercial Lines Insurance",
        "Client Retention",
        "Email Support",
        "Policyholder Assistance",
        "Multichannel Customer Service"
      ],
      "tools": [
        "Ezlynx",
        "Better Agency",
        "AMS360",
        "Nowcerts",
        "Salesforce",
        "Microsoft Office",
        "Google Workspace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "PALOMINO INSURANCE",
          "position": "Virtual Assistant",
          "period": "SEPT 2024 - PRESENT",
          "description": "• Manages comprehensive client communication, including inbound/outbound calls, email, and text support to handle inquiries and ensure client retention.\\n• They are experienced in quoting insurance through Ezlynx and other carriers and are proficient with both Ezlynx and Better Agency software."
        },
        {
          "company": "ONE STOP INSURANCE",
          "position": "Virtual Assistant",
          "period": "MAY 2022 - MAY 2024",
          "description": "• Managed comprehensive client communication, including inbound/outbound calls, email, and text support to handle customer inquiries, new client assistance, and billing follow-ups to ensure client retention.\\n• They are experienced in quoting insurance through Ezlynx and other carriers."
        },
        {
          "company": "WE INSURE",
          "position": "Virtual Assistant",
          "period": "OCT 2021 - MAY 2022",
          "description": "• Managed comprehensive client communication, including inbound/outbound calls, email, and text support to handle customer inquiries, new client assistances, and billing follow-ups, ensuring client retention.\\n• They are experienced in quoting insurance through Ezlynx and other carriers and are proficient in the Ezlynx platform."
        },
        {
          "company": "AGENCY VA",
          "position": "Virtual Assistant",
          "period": "AUG 2020 - JAN 2022",
          "description": "• Provided virtual assistance to US-based insurance firms, leveraging a background in both Personal and Commercial Insurance.\\n• They are highly experienced with various CRM and AMS platforms, including Ezlynx, Nocerts, AMS360, and Salesforce, and are adept at tailoring their skills to meet diverse client needs."
        },
        {
          "company": "TELETECH PHILIPPINES",
          "position": "Customer Service Representative III",
          "period": "JUL 2018 - MAY 2020",
          "description": "• Managed an advertising and marketing account for Sensio White Pages, providing comprehensive customer support through inbound/outbound calls, email, and chat.\\n• They possess technical skills in lead research, data mining for businesses, and working with APIs, complemented by a background in Salesforce."
        },
        {
          "company": "SWEET G CAKES AND PASTRY MANUFACTURING",
          "position": "Pastry Cook",
          "period": "APR 2018 - DEC 2020",
          "description": "• As a Pastry Cook, they managed a wide range of duties including baking, cake decorating, menu planning, and product research and development.\\n• Their responsibilities also extended to operational tasks such as monitoring and managing stock levels."
        },
        {
          "company": "SALVATORE CUOMO BAR AND RESTAURANT",
          "position": "Pastry Cook",
          "period": "APR 2016 - FEB 2018",
          "description": "• Responsible for a variety of baking duties including pastry and bread making, as well as contributing to menu planning and research and development.\\n• This included gaining versatile experience as a pizza maker."
        },
        {
          "company": "HOLIDAY INN & SUITES MAKATI",
          "position": "Intern Cook",
          "period": "SEPT 2015 - DEC 2015",
          "description": "• Gained comprehensive, hands-on experience across all kitchen stations, including Hot, Cold, Pastry, Vegetable Prep, and Butchery.\\n• They were actively involved in the full production cycle for breakfast and lunch buffets, which included cooking hot dishes, preparing salads and a la carte items, and handling the preparation, baking, and decoration of desserts."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "95",
      "englishDescription": "Shows excellent fluency and clear pronunciation with natural flow. Effectively uses advanced vocabulary and complex grammar to communicate precise and nuanced ideas.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "LoisProfile.jsx"
    },
    {
      "name": "LORENZ",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Lorenz.webp",
      "summary": "Focused driven Virtual Assistant with a solid background in insurance processing and customer support. Lorenz has extensive experience assisting U.S.-based clients, particularly in home and auto insurance coverage. With a strong blend of communication, organizational skills, and attention to detail, he confidently manages tasks such as:",
      "tagline": "Lorenz brings a professional presence to any team, with a passion for delivering efficient insurance workflows and top-tier customer experiences.",
      "videoUrl": "https://www.youtube.com/embed/3if5VzuvLNc",
      "skills": [
        "Insurance Processing",
        "Endorsements & Reinstatements",
        "Collaboration with Underwriters",
        "Customer Service",
        "Inbound/Outbound Calls",
        "Email & Calendar Management",
        "Data Entry Support",
        "Renewals",
        "Cancellations",
        "Mortgage Clause Management",
        "Policy Change Verification"
      ],
      "tools": [
        "CRMs",
        "Ezlynx",
        "Nationwide Portal",
        "Progressive Portal",
        "Microsoft Office",
        "Google Suite",
        "Zoom Workplace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "THE WOODLANDS FINANCIAL GROUP",
          "position": "Insurance Virtual Assistant",
          "period": "JAN 2023 - DEC 2024",
          "description": "• Able to process the policy of insured for home and auto insurance.\\n• Sending email reminder for renewals, cancellation and reinstatement notice.\\n• Able to process trailing documents for new business.\\n• Able to process endorsement directly to carrier website."
        },
        {
          "company": "VERSATEL SOLUTIONS",
          "position": "Health Insurance - CSR",
          "period": "MAY - AUG 2022",
          "description": "• We manage to explain our products and services to our client and must shown interest on what we are selling in order to qualify as leads.\\n• Transfer a qualify leads to our licensed agent for them to convert and consider as qualified sales."
        },
        {
          "company": "FONERANGE COMMUNICATION INC.",
          "position": "Sales Associate",
          "period": "APR 2020 - JUN 2022",
          "description": "• Able to manage our product inventory.\\n• Product marketing advertisement.\\n• Able to manage our monthly target quota.\\n• Provide a better sales marketing and must shown interest to our product and services"
        }
      ],
      "discResult": "S+C",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nConscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.",
      "englishScore": "6.9",
      "englishDescription": "Speaks clearly with good fluency and pronunciation. Shows comfort with complex ideas and grammar, using vocabulary effectively to convey meaning.",
      "education": {
        "school": "La Consolacion University Philippines / Centro Escolar University",
        "degree": "Bachelor in Tourism Management / Bachelor in Hotel Management",
        "date": "2016 - 2019 / 2008 - 2012"
      },
      "sourceFile": "LorenzProfile.jsx"
    },
    {
      "name": "MA. VENUS",
      "title": "INSURANCE AGENT | AUTO INSURANCE SPECIALIST",
      "image": "/images/VAs/Ma Venus.webp",
      "summary": "Ma. Venus is an insurance agent with 1.5 years of experience, specializing in auto insurance sales, policy servicing, coverage guidance, quoting, and policy adjustments. She brings together solid technical skills and a client-centered approach, ensuring pre-sale policy review and clear, effective communication with insured clients.",
      "tagline": "Venus brings a well-rounded blend of insurance knowledge, sales experience, technical skills, and customer service expertise to help agencies deliver efficient and accurate insurance operations.",
      "videoUrl": "https://www.youtube.com/embed/AgUkZKEWzkw",
      "skills": [
        "Auto Insurance Sales & Policy Management",
        "Quotes & Policy Changes",
        "Coverage Explanations & Client Support",
        "Endorsement Handling",
        "Payment & Billing Coordination",
        "Certificate of Insurance Preparation"
      ],
      "tools": [
        "Salesforce",
        "Microsoft Excel",
        "Microsoft Office",
        "Financial Software"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [],
      "discResult": "C+S",
      "discResultDescription": "Conscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.\\n\\nSteadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "70",
      "englishDescription": "Speaks clearly with understandable pronunciation and reasonable fluency. Uses vocabulary and grammar effectively, with a growing ability to express more complex ideas.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "MaVenusProfile.jsx"
    },
    {
      "name": "MARIA D.",
      "title": "BILINGUAL ENGLISH-SPANISH SPEAKING VA",
      "image": "/images/VAs/Maria D.webp",
      "summary": "Maria is a bilingual insurance professional with three years of experience supporting U.S.-based insurance agencies across Property & Casualty and Commercial lines. She has managed renewals, endorsements, billing, underwriting coordination, and claims support for both personal and business accounts. Plus, she has extensive experience servicing VIP commercial clients, preparing certificates of insurance, and ensuring timely policy updates.",
      "tagline": "Maria brings a strong background in customer service across both personal and commercial lines, paired with a proactive, detail-driven approach to insurance operations. Her commitment to excellence ensures compliance with every policy she handles and every interaction she supports.",
      "videoUrl": "https://www.youtube.com/embed/ALQNI3jsBLs",
      "skills": [
        "Property & Casualty Insurance",
        "Commercial Insurance",
        "Client Relations",
        "Team Training & Support",
        "Commercial Lines Servicing",
        "Account Maintenance",
        "Compliance & Quality Assurance",
        "Claims Support",
        "Renewals & Endorsements",
        "Billing",
        "Underwriting Coordination",
        "Policy Documentation Management"
      ],
      "tools": [
        "Applied Epic",
        "Slack",
        "Microsoft Office",
        "Microsoft Teams",
        "Zoom Workplace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "RIZO INSURANCE GROUP LLC - INSURANCE AGENCY",
          "position": "Office & Customer Service Manager",
          "period": "NOV 2022 - SEPT 2025",
          "description": "• Oversee commercial and personal line renewals, reviewing documentation, billing, underwriting memos, and payments to ensure accuracy and timely continuation of policies.\\n• Bind personal and commercial insurance policies, ensuring regulatory compliance and high levels of client satisfaction.\\n• Act as the primary point of contact for VIP clients, resolving underwriting, claims, and billing issues while protecting client interests.\\n• Guide commercial clients through insurance audits, clarifying compliance requirements and supporting timely submissions.\\n• Serve as liaison between office staff and senior management, fostering open communication and a positive workplace culture.\\n• Improved operational efficiency by designing and implementing a responsibility assignment matrix, increasing role clarity and workflow efficiency.\\n• Lead onboarding and training for new employees, delivering practical instruction on tools, SOPs, and weekly Q&A sessions to accelerate integration.\\n• Key Achievement: solely managed VIP client relationships, implementing custom tracking tools and regular policy review meetings, strengthening long-term partnerships, and proactively addressed client needs."
        },
        {
          "company": "NAVEX GLOBAL",
          "position": "Communication Specialist",
          "period": "FEB 2022 - AUG 2022",
          "description": "• Conducted and documented time-sensitive interviews, ensuring accurate reporting and compliance with client regulatory requirements.\\n• Optimized call intake and documentation workflows, maintaining 100% adherence to established protocols and consistently exceeding company KPIs.\\n• Delivered high-quality service that reduced call hold times, improving caller experience and supporting contractual service-level agreements.\\n• Translated sensitive documents with accuracy and confidentiality to meet client expectations.\\n• Key Achievement: recognized for excellence in customer service by facilitating concise, tailored interviews that met and exceeded performance expectations."
        },
        {
          "company": "ALIAR SA",
          "position": "Production Planning Analyst Assistant",
          "period": "DEC 2020 - NOV 2021",
          "description": "• Led weekly production planning by analyzing demand and calculating output requirements.\\n• Coordinated national dispatches with the logistics team to ensure timely distribution.\\n• Resolved production issues in real time to minimize downtime and maintain workflow continuity.\\n• Generated daily, weekly, and monthly compliance reports to monitor performance and address process deviations.\\n• Key Achievements:\\n  ○ Standardized and optimized Excel planning tools using the Kaizen method, reducing weekly planning time by 20%.\\n  ○ Created new tracking systems and a comprehensive instruction manual, enabling seamless adoption and continuity by team members."
        },
        {
          "company": "VANGUARDIA LIBERAL - REGIONAL NEWSPAPER",
          "position": "Intern",
          "period": "APR 2016 - SEPT 2016",
          "description": "• Developed and executed online loyalty strategies to enhance subscriber engagement.\\n• Tracked and analyzed subscriber requests, ensuring accurate and timely resolution.\\n• Audited partner entities to monitor compliance with alliance agreements.\\n• Oversaw subscriber card inventory control to maintain accuracy and availability.\\n• Delivered customer support to subscribers, strengthening retention and satisfaction.\\n• Key Achievement: Analyzed workflow bottlenecks in the audit process and recommended a data solution that was approved by senior leadership. The initiative reduced delays, increased efficiency, and enhanced data accuracy."
        }
      ],
      "discResult": "I",
      "discResultDescription": "Influence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.",
      "englishScore": "6.6/9",
      "englishDescription": "Demonstrates clear communication with understandable pronunciation and steady pacing. Uses everyday vocabulary and basic grammar accurately, showing confidence in familiar topics and improving control in extended speech.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "MariaDProfile.jsx"
    },
    {
      "name": "MARIA FERNANDA",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Maria.webp",
      "summary": "Maria Fernanda is a dedicated Virtual Assistant with strong experience in the insurance industry. Her background includes handling client communications and coordinating with internal teams to ensure smooth insurance operations. She brings reliability, attention to detail, and a bilingual advantage to every task.",
      "tagline": "Maria is well-prepared to assist insurance professionals and business owners, offering reliable support rooted in effective communication, attention to detail, and a strong commitment to client satisfaction.",
      "videoUrl": "https://www.youtube.com/embed/TNXDeGsyIkM",
      "skills": [
        "Email & Calendar Management",
        "Customer Service",
        "Acord Forms",
        "Policy Changes",
        "Quote Generation",
        "Document Filing",
        "Billing Assistance",
        "Inbound & Outbound Calls",
        "Canva for Social Media",
        "Social Media Management",
        "Presentation & Video Editing"
      ],
      "tools": [
        "CRM Tools",
        "HR Platforms",
        "Canva",
        "Microsoft Office",
        "Google Workspace",
        "Zoom Workplace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "SEGUROS SURA",
          "position": "Customer Service",
          "period": "2017",
          "description": "• I was in charge of customer service, recruitment and management of personnel, database monitoring, hiring management."
        },
        {
          "company": "SERIGAS DEL CARIBE S.A",
          "position": "Human Resource",
          "period": "2018 - 2021",
          "description": "• Worked closely with clients and members of the Human Resources team, for hiring and payroll management."
        },
        {
          "company": "MOSAIC S.A",
          "position": "Reception Manager",
          "period": "2021 - 2022",
          "description": "• I worked as a bilingual Reception Manager, leading the management and attention to international clientele, ensuring exceptional service and facilitating fluid communication in two languages."
        },
        {
          "company": "FRCONTENT LLC",
          "position": "Executive Assistant",
          "period": "2022 - 2024",
          "description": "• I worked as an executive assistant and leader of the Culture and HR department in a bilingual international company, supervising executive administrative functions and managing initiatives related to corporate culture and human resources to ensure an efficient and collaborative work environment."
        },
        {
          "company": "OCEAN VA SOLUTIONS",
          "position": "Customer Service & Administrative Assistant",
          "period": "AUG 2024 - JUN 2025",
          "description": "• Managed inbound/outbound calls, email and calendar coordination, and quote generation for insurance clients.\\n• Handled policy changes and client records using Ezlynx, Neptune, TWIA, TFPA, and Wellington platforms.\\n• Created branded content, presentations, and short videos using Canva and Adobe; supported social media management.\\n• Assisted with billing, HR-related tasks, and data organization using advanced Excel skills."
        }
      ],
      "discResult": "I+S",
      "discResultDescription": "Influence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.\\n\\nSteadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "6.9",
      "englishDescription": "Speaks clearly and fluently with good pronunciation and effective use of vocabulary. Demonstrates solid grammar skills and expresses complex ideas with coherence and flexibility.",
      "education": {
        "school": "IE Centro Inca / U. Autónoma del Caribe",
        "degree": "Commercial Banking Technique / Maritime and River Administrator",
        "date": "2015 - 2017 / 2018 - 2023"
      },
      "sourceFile": "MariaFernandaProfile.jsx"
    },
    {
      "name": "MARIA PAULA",
      "title": "ENGLISH-SPANISH BILINGUAL VA | MEDICAL ASSISTANT",
      "image": "/images/VAs/Maria Paula.webp",
      "summary": "Maria Paula is a bilingual professional with over three years of experience supporting medical offices and healthcare professionals. Her background includes managing patient information, coordinating appointments, updating medical records, and ensuring billing accuracy and HIPAA compliance. With strong organizational skills, Maria Paula brings a service-oriented approach that blends administrative efficiency with cultural and linguistic proficiency.",
      "tagline": "Maria Paula combines healthcare administration expertise with professional bilingual communication, offering dependable and empathetic support to patients, providers, and clients alike.",
      "videoUrl": "https://www.youtube.com/embed/yxgaoJEpdGg",
      "skills": [
        "Bilingual Interpretation",
        "Customer Care",
        "Data Entry",
        "Administrative Assistance",
        "Patient Coordination",
        "HIPAA Compliance",
        "Appointment Scheduling",
        "Record Management",
        "Medical Office Support",
        "Billing / Documentation Accuracy",
        "Client Communication"
      ],
      "tools": [
        "Zoom Workplace",
        "Google Workspace",
        "Microsoft Office",
        "Microsoft Teams",
        "Trello",
        "Slack"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "VRI MILLENNIALS VIRTUAL SERVICES",
          "position": "Medical Interpreter",
          "period": "NOVEMBER 2022 - DECEMBER 2024",
          "description": "• Simultaneous interpretation between patients and health care providers, appointment scheduling for patients who have been on the waiting lists, and interpretation of medical interviews, and provide information about medical procedures and instructions to limited English proficiency patients."
        },
        {
          "company": "TELEPERFORMANCE S.A.S.",
          "position": "Bilingual Agent",
          "period": "MARCH 2021 - SEPTEMBER 2022",
          "description": "• Customer service to more than 60 people daily, problem solving, answering questions, product returns. Problem solving range to a 95%."
        },
        {
          "company": "PROFIN COLOMBIA S.A.S.",
          "position": "Freelance Business Advisor",
          "period": "JUNE 2018 - APRIL 2019",
          "description": "• Cold calling and data management. Use of office tools for results displaying, business and legal advising, quotations, business closing and after-sales services."
        }
      ],
      "discResult": "I+S",
      "discResultDescription": "Influence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.\\n\\nSteadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "7.3/9",
      "englishDescription": "Demonstrates clear and confident communication with natural pronunciation and smooth fluency. Uses a wide range of vocabulary and complex grammar accurately to express detailed and well-structured ideas.",
      "education": {
        "school": "Not provided",
        "degree": "Degree in Economics with an emphasis in International Business",
        "date": null
      },
      "sourceFile": "MariaPaulaProfile.jsx"
    },
    {
      "name": "MELISSA",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Melissa.webp",
      "summary": "Melissa is an experienced and detail-oriented Virtual Assistant with over 10 years of combined expertise in project management, insurance support, customer service, and process training. Known for her reliability, results-driven mindset, and ability to thrive under pressure, Melissa provides outstanding support tailored to each client\\",
      "tagline": "Melissa is fully equipped to support businesses and professionals seeking dependable assistance with a focus on insurance servicing, client communication, and operational efficiency.",
      "videoUrl": "https://www.youtube.com/embed/6dB2M8wAkjE",
      "skills": [
        "Home & Auto Insurance",
        "Client Issue Resolution",
        "Policy Review & Update",
        "Project Coordination",
        "Calendar & Email Management",
        "Inbound & Outbound Calls",
        "Payment Processing",
        "Insurance Claims Follow-ups",
        "Quote Generation",
        "COI (Certificate of Insurance) & Declaration Pages",
        "Documentation Management"
      ],
      "tools": [
        "CRMs",
        "Google Suite",
        "Microsoft Office",
        "Zoom Workplace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "COGNIZANT TECHNOLOGY SOLUTIONS",
          "position": "Process Specialist / Process Trainer / Quality Analyst",
          "period": "FEB 2016 - MAR 2022",
          "description": "• Coordinated with the appropriate department during pre-process and process training to discuss training preparations including the timeline and the agenda.\\n• Facilitated domain and process training for insurance accounts - voice and chat support.\\n• Helped the team in meeting the service level targets by taking chats as needed, reviewing the recorded chats and provide feedback as deemed necessary.\\n• Conducted huddlesessions to discussthe challenges of the team and how to improve them."
        }
      ],
      "discResult": "I+S",
      "discResultDescription": "Influence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.\\n\\nSteadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "81",
      "englishDescription": "Communicates fluently and clearly on a wide range of topics with good command of grammar and vocabulary. Pronunciation is easy to understand and ideas are expressed with confidence and coherence.",
      "education": {
        "school": "Philippine Normal University, Manila / National Teachers College, Manila",
        "degree": "Bachelor of Science in Biology / Certificate in Teaching Program Education",
        "date": null
      },
      "sourceFile": "MelissaProfile.jsx"
    },
    {
      "name": "MICHELLE",
      "title": "ENGLISH-SPEAKING VA | INSURANCE SPECIALIST",
      "image": "/images/VAs/Michelle.webp",
      "summary": "Michelle has one year of experience in the U.S. insurance industry, supporting personal lines. She specializes in quoting, remarketing, and policy servicing for auto, homeowners, renters, dwelling fire, condo, umbrella, and personal articles policies. Michelle also assists with billing inquiries, payments, and endorsements—ensuring that every update and communication meets agency and carrier standards for accuracy and compliance.",
      "tagline": "Michelle combines strong technical proficiency with exceptional attention to detail. Her hands-on experience across multiple CRMs and carrier platforms enables her to deliver reliable, end-to-end insurance support that enhances client satisfaction and operational efficiency.",
      "videoUrl": "https://www.youtube.com/embed/sjVqZfkunbY",
      "skills": [
        "Endorsements",
        "Quoting",
        "Renewals",
        "Client Support",
        "Billing Inquiries",
        "Auto",
        "Homeowners",
        "COIs",
        "Documentation Uploads",
        "Payments",
        "Renters",
        "Umbrella",
        "Remarketing",
        "Cancellations",
        "E-Signature",
        "Policy Servicing"
      ],
      "tools": [
        "PL Rater",
        "Applied Rater",
        "Applied Epic",
        "QQ Catalyst",
        "AMS360",
        "Ezlynx",
        "HawkSoft",
        "ImageRight",
        "Cisco Webex",
        "RingCentral",
        "Zoom Workplace",
        "Microsoft Office/Teams"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "LINGOSTAR",
          "position": "Online ESL Tutor",
          "period": "MAR 2024 - APR 2024",
          "description": "• Teach basic English to children aged 5-8 years old"
        },
        {
          "company": "CITIGLOBAL REALTY AND DEVELOPMENT INCORPORATION",
          "position": "Marketing Specialist",
          "period": "SEPT 2022 - OCT 2022",
          "description": "• Rendered 200-hr immersion\\n• Create Facebook posts\\n• Answer Facebook chat and comment inquiries"
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "75",
      "englishDescription": "Communicates clearly with generally good pronunciation and fluency. Uses appropriate vocabulary and grammar to express ideas effectively, with growing confidence in more complex structures.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "MichelleProfile.jsx"
    },
    {
      "name": "MOISES",
      "title": "BILINGUAL ENGLISH-SPANISH SPEAKING VA",
      "image": "/images/VAs/Moises.webp",
      "summary": "Moises is a bilingual insurance specialist with more than two years of experience focused on commercial trucking coverage. He\\",
      "tagline": "Moises combines analytical skills with hands-on experience in commercial trucking insurance, ensuring compliance, precision, and timely service. His proactive mindset and mastery of tools like ConceptOne and CAB help drive accuracy and trust across every policy handled.",
      "videoUrl": "https://www.youtube.com/embed/tbz0iRIWaps",
      "skills": [
        "Endorsements",
        "Process Optimization",
        "Documentation Review",
        "Billing Tasks",
        "Policy Binding",
        "Legal Format Correction",
        "Data Entry",
        "Claims Support",
        "Vehicle Coverage Modifications",
        "MVR and CAB Report Analysis",
        "Policy Filing"
      ],
      "tools": [
        "ConceptOne (C1)",
        "CAB",
        "Microsoft Office",
        "Microsoft Teams"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "ACROSS AMERICA INSURANCE SERVICES",
          "position": "Department Administrator - Binds",
          "period": "Present",
          "description": "• Managed the bind department, issuing policies, invoices, binders, and temporary policy numbers.\\n• Reviewed and processed documentation for carriers, entering information into the ConceptOne system.\\n• Collaborated closely with the Underwriting team to identify errors in legal documentation and update record formats.\\n• Spearheaded improvements that resulted in a faster policy issuance process, reducing turnaround time by 75% - 100%.\\n• Enhanced department administration by reorganizing workflows, leading to improved efficiency and reduced processing delays.\\n• Improved team training programs, leading to a 50% increase in productivity and better alignment with company standards.\\n• Identified and resolved discrepancies in documentation, resulting in a 50% reduction in errors and enhanced process optimization."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "80",
      "englishDescription": "Shows confidence and fluent communication with clear pronunciation. Uses a good range of vocabulary and grammar structures effectively to express ideas with clarity and coherence.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "MoisesProfile.jsx"
    },
    {
      "name": "PATRICIA",
      "title": "ENGLISH SPEAKING VA | INSURANCE SPECIALIST",
      "image": "/images/VAs/Patricia.webp",
      "summary": "Patricia is an experienced Insurance Virtual Assistant with around five years of U.S. insurance experience, supporting agencies across both personal and commercial lines. Her background includes homeowners, condo, renters, dwelling fire, auto, earthquake, flood, business & property, workers\\",
      "tagline": "Patricia\\",
      "videoUrl": null,
      "skills": [
        "Renewals",
        "Certificates of Insurance",
        "Endorsements",
        "Client & Carrier Communication",
        "Underwriting",
        "Billing & Payment Coordination",
        "Documentation Review",
        "Commercial Lines",
        "Quoting",
        "Cancellations",
        "Policy Servicing",
        "Claims History Requests",
        "Personal Lines"
      ],
      "tools": [
        "Ezlynx",
        "Airtable",
        "AMS360",
        "Salesforce",
        "Zendesk",
        "Applied Epic",
        "Google Workspace",
        "Microsoft Office"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "RENTBIRD",
          "position": "Appointment Setter",
          "period": "MAY 2025 - 2025",
          "description": "• Call or message leads from provided databases or CRMs.\\n• Update CRM records with prospect notes and status.\\n• Schedule meetings between sales representatives and leads.\\n• Send confirmations and follow-up reminders to prospects."
        },
        {
          "company": "RUSS INSURANCE AGENCY",
          "position": "Insurance Virtual Assistant",
          "period": "APR 2025 - 2025",
          "description": "• Prepare, update, and send Certificates of Insurance (COIs).\\n• Assist in policy renewals, including gathering updated info and loss runs.\\n• Process endorsements, cancellations, and policy changes.\\n• Organize and maintain digital records of client files and policies.\\n• Fill out ACORD forms and application documents."
        },
        {
          "company": "GOTEAM VIRTUAL ASSISTANTS",
          "position": "Underwriting Insurance Assistant",
          "period": "AUG 2024 - DEC 2024",
          "description": "• Processed commercial insurance policy applications, ensuring accuracy and completion of necessary documentation.\\n• Prepared quotes for commercial insurance policies and ensured timely renewals of existing policies.\\n• Updated Salesforce with accurate client and policy information and ensured compliance with underwriting standards.\\n• Collaborated with underwriting teams to ensure smooth policy issuance and resolution of issues."
        },
        {
          "company": "LESLIE SAWYER INSURANCE AGENCY",
          "position": "Assistant Account Manager",
          "period": "FEB 2019 - MAY 2023",
          "description": "• Supported daily operations of account management, handling insurance inquiries via email, calls, and SMS.\\n• Proficient in quoting personal insurance services using the EZ Lynx CRM system.\\n• Managed policy renewals, non-renewals, and handled underwriting memos and non-payment policies.\\n• Maintained accurate policy and client data in Google Sheets, ensuring compliance with industry standards.\\n• Provided excellent customer support by addressing policy inquiries, coverage details, and billing issues."
        },
        {
          "company": "MICROSOURCING",
          "position": "Camp Australia - Customer Care Associate",
          "period": "SEPT 2016 - FEB 2019",
          "description": "• Handled high volumes of inbound and outbound calls while maintaining a focus on customer satisfaction.\\n• Responded to inquiries via email using Microsoft Outlook and managed customer concerns related to childcare bookings and entitlements.\\n• Utilized Zendesk to manage and resolve customer issues efficiently, ensuring data accuracy."
        },
        {
          "company": "ALTISOURCE",
          "position": "Technical Support Representative",
          "period": "JAN 2016 - JUL 2016",
          "description": "• Installed/repaired hardware & software, particularly with the POS system.\\n• Utilized Zendesk Ticketing System to address client concerns and create tickets if necessary.\\n• Managed call flow and provided technical support to customers."
        },
        {
          "company": "TELEPERFORMANCE",
          "position": "Technical Customer Service Associate",
          "period": "JAN 2014 - MAR 2015",
          "description": "• Promptly answered telephone calls, minimizing abandoned calls.\\n• Utilized scripting skills to enhance internet calls.\\n• Performed basic troubleshooting"
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "100",
      "englishDescription": "Demonstrates exceptional fluency and precision with native-like pronunciation and effortless delivery. Uses an extensive vocabulary and flawless grammar to express complex and nuanced ideas naturally.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "PatriciaProfile.jsx"
    },
    {
      "name": "PAVEL",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Pavel.webp",
      "summary": "Bilingual Virtual Assistant with a strong foundation in customer service, insurance operations, and creative marketing. He brings 6+ years of experience in graphic design, SEO, content creation, and digital campaign management across multiple industries. He can successfully manage:",
      "tagline": "He\\",
      "videoUrl": "https://www.youtube.com/embed/_reMSeE_gyY",
      "skills": [
        "Email & Calendar",
        "Event Organization & Coordination",
        "Copywriting",
        "Audiovisual Content Production",
        "Inbound & Outbound Calls",
        "Graphic Design",
        "Social Media Campaign Management",
        "UX/UI Web Design",
        "Video Editing",
        "Data Entry & CRM Updates",
        "Branding",
        "SEO & AEO",
        "Landing Page Creation",
        "E-Commerce Optimization"
      ],
      "tools": [
        "Adobe CC",
        "AgencyZoom",
        "Canva",
        "Ezlynx",
        "MS Office",
        "Zoom Workplace",
        "Google Workspace"
      ],
      "equipment": [
        "One-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "SANDUNGA",
          "position": "Content Creator & Marketing Strategist",
          "period": "2022 - 2025",
          "description": "• Designed visual content and digital campaigns for concerts and cultural events featuring national and international artists.\\n• Created social media campaigns, promotional videos, and branding materials to increase event attendance and online engagement.\\n• Led the digital marketing strategy for medical business, including SEO and AEO (Answer Engine Optimization) to improve online discoverability.\\n• Built and optimized professional websites, implementing accessibility standards, legal compliance, and user-friendly design.\\n• Produced blog posts, landing pages, and audiovisual content for social media and patient outreach.\\n• Developed a tiered digital service model for professionals, combining content creation, SEO, and web design solutions."
        },
        {
          "company": "PROPOSITIVE AGENCY",
          "position": "Audiovisual Content Creator",
          "period": "2020 - 2022",
          "description": "• Produced tailored content for restaurants, e-commerce brands, and small businesses.\\n• Managed full cycle video production including scripting, shooting, editing, and post-production.\\n• Enhanced content performance based on data analytics and audience insights"
        }
      ],
      "discResult": "I+D",
      "discResultDescription": "Influence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.\\n\\nDominance (D) - Proactive and goal-driven. D-type VAs take initiative, solve problems efficiently, and thrive in fast-paced environments.",
      "englishScore": "6.7",
      "englishDescription": "Speaks clearly and fluently with minimal effort, using a range of vocabulary and expressions to convey ideas effectively. Grammar and pronunciation are generally accurate, supporting coherent communication.",
      "education": {
        "school": "Universidad de Guadalajara / University of New Mexico",
        "degree": "Bachelor\\",
        "date": "2016 - 2020 / 2019"
      },
      "sourceFile": "PavelProfile.jsx"
    },
    {
      "name": "RAFAEL",
      "title": "ENGLISH SPEAKING VA | INSURANCE",
      "image": "/images/VAs/Rafael.webp",
      "summary": "Rafael is a versatile Virtual Assistant with six years of experience in the insurance industry, primarily in personal lines. He has handled policy enrollments, terminations, renewals, mortgage changes, data entry, and inbound/outbound calls with professionalism and precision. Proficient in trading platforms and CRM systems, Rafael brings reliability, attention to detail, and a calm demeanor to every task.",
      "tagline": "Rafael finds joy in assisting colleagues and clients, delivering quality results under pressure. His experience across multiple insurance sectors and CRM platforms allows him to adapt quickly and contribute to smooth operations and client satisfaction.",
      "videoUrl": "https://www.youtube.com/embed/S19B0sRiohI",
      "skills": [
        "Personal Health Insurance Support",
        "Renewals & Cancellations",
        "Email & Schedule Management",
        "General Office Support",
        "Insurance Verification & Authorization",
        "Data Entry & Management",
        "Policy Enrollments & Terminations",
        "Quote Preparation & Price Quotation",
        "Administrative Support"
      ],
      "tools": [
        "Hawksoft",
        "Ezlynx",
        "Q Catalyst",
        "PL Plater",
        "AgencyBloc",
        "AgencyZoom"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "STRACHAN NOVAK INSURANCE SERVICES",
          "position": "Insurance Virtual Assistant",
          "period": "JUNE 2024 - APRIL 2025",
          "description": "• Most recent and comprehensive role, where he managed insurance verification, authorizations, and client relationship tasks across personal lines."
        },
        {
          "company": "OFFICE BEACON PHILIPPINES, INC.",
          "position": "Insurance Virtual Assistant",
          "period": "JAN 2023 - APR 2024",
          "description": "• Provided general support for insurance operations including verification, authorization, and email management."
        },
        {
          "company": "CORNERSTONE INSURANCE GROUP",
          "position": "Insurance Virtual Assistant",
          "period": "SEPT 2023 - JAN 2024",
          "description": "• Focused on Healthcare/Medicare insurance support tasks like patient follow-ups, prescription refills, and scheduling."
        },
        {
          "company": "AFFINITY INSURANCE GROUP",
          "position": "Insurance Virtual Assistant",
          "period": "JUL 2023 - SEPT 2023",
          "description": "• Supported Auto and Home Insurance processes such as quotes, cancellations, renewals, and data entry."
        },
        {
          "company": "HEALTH WEALTH ADVOCATES",
          "position": "Insurance Virtual Assistant",
          "period": "MAR 2023 - JUN 2023",
          "description": "• Worked on Health Insurance policy terminations, enrollments, data entry, and quoting."
        },
        {
          "company": "BOOMERING, INC.",
          "position": "Insurance Virtual Assistant",
          "period": "OCT 2021 - SEPT 2022",
          "description": "• Supported Farmers Insurance clients in Personal Auto and Home Lines, offering policy options and assisting clients through the insurance process."
        }
      ],
      "discResult": "C+S",
      "discResultDescription": "Conscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.\\n\\nSteadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "6.8/9",
      "englishDescription": "Speaks clearly with generally good fluency and pronunciation, making communication easy to follow. Uses a solid range of vocabulary and grammar to express ideas, with occasional pauses that affect clarity.",
      "education": {
        "school": "Holy Angel University",
        "degree": "Bachelor of Science in Psychology",
        "date": "2019 - 2022"
      },
      "sourceFile": "RafaelProfile.jsx"
    },
    {
      "name": "RAINIER",
      "title": "BILINGUAL VA | COMMERCIAL AND P&C INSURANCE SPECIALIST",
      "image": "/images/VAs/Rainier.webp",
      "summary": "Rainier is an experienced Insurance Virtual Assistant with 7 years supporting U.S. brokers across personal and commercial lines. He has worked on quoting, submissions, renewals, endorsements, certificates, claims, and loss payee updates while liaising with underwriters and policyholders.",
      "tagline": "Rainier is a bilingual Virtual Assistant with broad insurance experience in personal and commercial P&C lines. Self-motivated and result-oriented, he is skilled in quoting, endorsements, certificates, and carrier portal servicing.",
      "videoUrl": "https://www.youtube.com/embed/Gl_Rijv44Ec",
      "skills": [
        "Loss Payee Updates",
        "Personal Lines - Auto, Home, Condo, Renters, Dwelling, Fire",
        "Quoting & Submissions",
        "Direct Broker & Underwriter Communication",
        "Policy Renewals & Cancellations",
        "Certificates of Insurance (COI)",
        "Claims Reporting & Processing",
        "Commercial Lines - BOPs, Workers\\",
        ",\n      "
      ],
      "tools": [
        "AMS360",
        "Ezlynx",
        "QQ Catalyst",
        "Carrier Portals",
        "Microsoft Office",
        "Applied Epic"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "FREELANCE INSURANCE VA",
          "position": "Insurance Virtual Assistant",
          "period": "SEPT 2021 - MARCH 2025",
          "description": "• Help insurance brokers in growing their business. Creating submissions, Quotes, Binding, and Policy Servicing like, endorsement, cancellations, certificate, recommendations and audits."
        },
        {
          "company": "INSURANCE VA SPECIALIST",
          "position": "Insurance VA Specialist",
          "period": "DEC 2018 - SEPT 2021",
          "description": "• Help insurance brokers in growing their business. Creating submissions, Quotes, Binding, and Policy Servicing like, endorsement, cancellations, certificate, recommendations and audits."
        },
        {
          "company": "GAMING TECHNICIAN",
          "position": "Gaming Technician",
          "period": "MAY 2018 - NOV 2018",
          "description": "• Inspects troubleshoots, and repairs electronic equipment in an arcade, gaming center, or another facility with video game equipment. In this role, you are required to test electronic and mechanical functions of games, replace broken or missing parts, and ensure the games are running smoothly."
        },
        {
          "company": "SERVICE TECH./ CARPET INSTALLER",
          "position": "Service Technician / Carpet Installer",
          "period": "NOV 2017 - MAR 2018",
          "description": "• Carried out day-day-day duties accurately and efficiently. Created plans and communicated deadlines to ensure projects were completed on time. Performed accurate measurements, cuts and trims to help flooring pieces fit specific room arrangements."
        },
        {
          "company": "GAMING TECHNICIAN",
          "position": "Gaming Technician",
          "period": "DEC 2016 - SEPT 2017",
          "description": "• Inspects troubleshoots, and repairs electronic equipment in an arcade, gaming center, or another facility with video game equipment. In this role, you are required to test electronic and mechanical functions of games, replace broken or missing parts, and ensure the games are running smoothly."
        }
      ],
      "discResult": "S+C",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nConscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.",
      "englishScore": "80",
      "englishDescription": "Communicates fluently with clear pronunciation and only occasional pauses. Uses a good range of vocabulary and grammar to express ideas effectively, including some complex thoughts.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "RainierProfile.jsx"
    },
    {
      "name": "RAYDON",
      "title": "ENGLISH-SPEAKING VA | INSURANCE SPECIALIST",
      "image": "/images/VAs/Raydon.webp",
      "summary": "Raydon is an Insurance Virtual Assistant with nearly four years of experience supporting U.S. agencies in personal and property lines. He specializes in renewals, endorsements, cancellations, and claims documentation while ensuring accuracy and compliance across all records. Skilled in Applied Epic and EZLynx, he manages client data, billing, quotes, and insurance quotations.",
      "tagline": "Raydon is the perfect option for insurance agencies looking for outstanding administrative support.",
      "videoUrl": "https://www.youtube.com/embed/2OIkxzcz-pw",
      "skills": [
        "Carrier Coordination",
        "Billing & E/T Updates",
        "Policy Renewals",
        "Policy Management",
        "Homeowners, Condo, Renters and Auto Lines",
        "COI Generation",
        "Cancellations",
        "Quotations",
        "Mortgage & Lienholder Process",
        "Underwriting",
        "Claims Assistance",
        "Endorsements"
      ],
      "tools": [
        "Canva",
        "Ezlynx",
        "QQ Catalyst",
        "AMS360",
        "Applied Epic",
        "Microsoft Office",
        "MS Teams",
        "MS Outlook",
        "Zoom Workplace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "WIN FORTUNETRAVEL AGENCY INC",
          "position": "Travel Agent",
          "period": "AUGUST 2019 - JULY 2020",
          "description": "• Following and improving document control and procedure.\\n• Ensuring all the documentation meets formal requirements and required standards."
        },
        {
          "company": "LIZARDBEARTASKING, INC",
          "position": "Quality Analyst",
          "period": "NOVEMBER 2017 - JULY 2019",
          "description": "• Responsible for checking the quality of the tasks of the teammate to the given dataset.\\n• Responsible for passing or failing the task of a teammate."
        },
        {
          "company": "MIASCOR CLARK AVIATION SERVICES CORP",
          "position": "Cabin Crew",
          "period": "NOVEMBER 2016 - NOVEMBER 2017",
          "description": "• Assists equipment operation in the preparations dollies/ULD and perform cabin cleaning job and other related activities."
        }
      ],
      "discResult": "S+C",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nConscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.",
      "englishScore": "70",
      "englishDescription": "Speaks clearly with good pronunciation and steady fluency. Uses everyday vocabulary and grammar accurately to express thoughts, with growing confidence in more complex language.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "RaydonProfile.jsx"
    },
    {
      "name": "REJEAN MAE",
      "title": "ENGLISH-SPEAKING VA",
      "image": "/images/VAs/Rejean.webp",
      "summary": "Resourceful Virtual Assistant with solid experience in customer service, insurance administration, and healthcare coordination. With a strong background supporting U.S.-based clients in insurance, she brings professionalism and empathy to her work. Rejean can confidently manage tasks such as endorsements, commercial auto insurance, quote generation, policy changes, customer service, inbound/outbound calls, email & calendar management, billing assistance, ACORD forms, prior authorizations & DME intake, COI documentation, and loss runs processing.",
      "tagline": "Rejean delivers dependable support in high-demand industries, helping clients streamline communication, improve insurance workflows, and deliver top-notch customer experiences.",
      "videoUrl": "https://www.youtube.com/embed/yeJ_lskQovU",
      "skills": [
        "Endorsements",
        "Commercial Auto Insurance",
        "Quote Generation",
        "Policy Changes",
        "Customer Service",
        "Inbound & Outbound Calls",
        "Email & Calendar Management",
        "Billing Assistance",
        "ACORD Forms",
        "Prior Authorizations & DME Intake",
        "COI Documentation",
        "Loss Runs Processing"
      ],
      "tools": [
        "CRM AMS",
        "Ezlynx",
        "Nowcerts",
        "Nationwide Portal",
        "Microsoft Office",
        "Google Suite",
        "Zoom Workplace"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "UYT",
          "position": "Insurance Virtual Assistant",
          "period": "FEB 2024 - JAN 2025",
          "description": "• Responsible for email management, processing documents and certificates, quotes, endorsements, acord forms, claims, loss runs and binding."
        },
        {
          "company": "SUPERSTAFF, PREMIER KIDS CARE",
          "position": "Healthcare Patient Account Coordinator & Case Manager",
          "period": "JUL 2023 - JAN 2024",
          "description": "• Deals with insurances, checkeligibility, requesting documents, submitting prior authorization, DME intakes and setting up orders shipment."
        },
        {
          "company": "CONCENTRIX, HEALTHY BENEFITS",
          "position": "Customer Advisor 1",
          "period": "DEC 2022 - FEB 2023",
          "description": "• Customer service in healthcare account Deals with insurances, checking eligibility assisting card replacement, OTC benefits, tracking orders etc."
        },
        {
          "company": "WAREMAN EXHIBITION LLC",
          "position": "Executive Telemarketing",
          "period": "2017 - 2019",
          "description": "• Telemarketing business projects/events & exhibitions in Dubai World Trade Center, setting up meetings meeting clients, design collaboration."
        },
        {
          "company": "IQOR PH, SPRINT",
          "position": "Customer Service Associate",
          "period": "SEPT 2016 - MAR 2017",
          "description": "• Customer service in telco account\\n• Answering incoming calls that deals with resolving customers basic technical issues, helps to trouble shoot devices, billing assistance and all other queries."
        },
        {
          "company": "SUTHERLAND, AMAZON",
          "position": "Customer Service Representative",
          "period": "FEB 2016 - JUL 2016",
          "description": "• Customer service in retail account\\n• Deals with the orders, delivery inquiries, returns and all other logistics queries"
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "90/C1",
      "englishDescription": "Indicates advanced English proficiency with the ability to communicate fluently and spontaneously. Can understand complex texts and use language effectively in social, academic, and professional settings.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "RejeanMaeProfile.jsx"
    },
    {
      "name": "ROCHELLE",
      "title": "INSURANCE VIRTUAL ASSISTANT | COMMERCIAL LINES SPECIALIST",
      "image": "/images/VAs/Rochelle.webp",
      "summary": "Rochelle is an experienced Insurance Virtual Assistant with a strong background in commercial lines policy, processing and administrative support. Her role involves ensuring accuracy in submissions, managing documents, and supporting agency workflows using platforms such as Applied Epic, Microsoft Office, Outlook, and Teams.",
      "tagline": "She is the ideal Virtual Assistant for insurance agencies and service-based businesses seeking a detail-oriented professional with hands-on experience in Commercial Lines policy processing and administrative support.",
      "videoUrl": "https://www.youtube.com/embed/aCJyNu79nto",
      "skills": [
        "Administrative Assistance & Reporting Support",
        "Commercial Lines Policy Processing",
        "Client Communication",
        "Claims Assistance",
        "Training & Assessment Experience",
        "Insurance Submission Desk Support",
        "Endorsements",
        "Renewals & Cancellations",
        "Collaboration Across Remote Teams",
        "Documentation Preparation",
        "Customer Service",
        "Data Entry & File Organization"
      ],
      "tools": [
        "Applied Epic",
        "Microsoft Office",
        "Microsoft Teams",
        "Google Workspace",
        "Zoom & Online Collaboration Tools"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "SWAK BPO CORP",
          "position": "Submission Desk Staff",
          "period": "AUG 2021 - 2025",
          "description": "• Processes and submits commercial and personal lines insurance policies such as GLTA, PROP, CPKG, BOP, WCOM, BAUT, and CUMB for U.S.-based agencies using Applied Epic."
        },
        {
          "company": "GNGN EIKAIWA PHILS., INC",
          "position": "Language Assessor and ESL Teacher",
          "period": "JUN 2019 - AUG 2021",
          "description": "• Conducted English lessons and language assessments for students focusing on grammar, pronunciation, and communication skills."
        },
        {
          "company": "CARLOS P. ROMULO MEMORIAL LIBRARY AND MUSEUM",
          "position": "Trainee",
          "period": "JAN 2019 - APR 2019",
          "description": "• Assisted with library operations, including organizing materials, supporting visitors, and managing administrative tasks."
        }
      ],
      "discResult": "S+C",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nConscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.",
      "englishScore": "85",
      "englishDescription": "Speaks clearly with good fluency and coherence, using a solid range of vocabulary to express ideas. Demonstrates accurate grammar and clear pronunciation.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "RochelleProfile.jsx"
    },
    {
      "name": "RONA MAE",
      "title": "INSURANCE VIRTUAL ASSISTANT",
      "image": "/images/VAs/Rona Mae.webp",
      "summary": "Rona Mae is a professional Insurance Virtual Assistant with a strong background in policy servicing, quoting, renewals, and administrative operations. She has supported agencies by processing renewals, handling applications, managing invoices, checking policies, and handling client documentation. She ensures accuracy and efficiency in managing policies, billing, and client communication.",
      "tagline": "Rona is an ideal Virtual Assistant for insurance agencies, HR teams, and service-based businesses seeking a professional who can combine insurance operations expertise with strong HR and administrative support to ensure seamless day-to-day efficiency.",
      "videoUrl": "https://www.youtube.com/embed/eHrDpnlAeoc",
      "skills": [
        "Processing Quarterly",
        "Payroll Compliance",
        "Insurance Quoting",
        "Recruitment",
        "Customer & Carrier Communication",
        "Documentation Management",
        "Invoice Processing",
        "Policy & Mortgage Updates",
        "Marketing Support",
        "Reshop Renewals",
        "Policy Updates"
      ],
      "tools": [
        "Ezlynx",
        "AMS",
        "QQ Catalyst",
        "Slack",
        "Canva",
        "Adobe Photoshop",
        "Ring Central",
        "Microsoft Office",
        "Microsoft Teams"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "FREELANCER",
          "position": "Insurance Virtual Assistant",
          "period": "2023 - 2025",
          "description": "• Provided comprehensive support in Personal Lines Insurance, including quoting, renewals, policy documentation, CRM and carrier site management, billing updates, and client communication using tools like EZLynx, AMS, QQ Catalyst, and Vertafore."
        },
        {
          "company": "SUNWEST, INC.",
          "position": "HR Assistant",
          "period": "2022 - 2024",
          "description": "• Handled full-cycle recruitment, onboarding, timekeeping, payroll processing, employee relations, and HRIS data management to support organizational HR functions."
        },
        {
          "company": "LRWC",
          "position": "HR Generalist",
          "period": "2013 - 2021",
          "description": "• Managed payroll, government compliance, loan processing, timekeeping, and HR reporting while ensuring accurate documentation and adherence to labor regulations."
        }
      ],
      "discResult": "S",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.",
      "englishScore": "85",
      "englishDescription": "Speaks clearly with good fluency and coherence, using a solid range of vocabulary to express ideas. Demonstrates accurate grammar and clear pronunciation.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "RonaMaeProfile.jsx"
    },
    {
      "name": "SANDRA",
      "title": "BILINGUAL ENGLISH-SPANISH VA",
      "image": "/images/VAs/Sandra.webp",
      "summary": "Bilingual Virtual Assistant with strong communication skills in both English and Spanish. With extensive experience providing customer service and being a sales consultant for Home, Auto, and Health insurance, Sandra can skillfully handle all aspects of insurance operations and client support.",
      "tagline": "She is ready to start helping your business grow right away! If you\\",
      "videoUrl": "https://www.youtube.com/embed/xrNMiTNBkcg",
      "skills": [
        "Commercial Home & Auto",
        "Email & Calendar",
        "Quote Generation",
        "Billing Assistance",
        "Policy Changes",
        "Mortgage Changes",
        "ACORD Forms",
        "COI Documentation",
        "Cancellation Notices",
        "Ezlynx Management"
      ],
      "tools": [
        "CRMs",
        "Slack",
        "Ezlynx",
        "Insurance Agents Portals",
        "Google Workspace",
        "Microsoft Office"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "PACIFIC PRIME INSURANCE",
          "position": "Sales Consultant",
          "period": "Current",
          "description": "• Managed full-cycle client support including quotes, policy processing, claims assistance, and performance reporting in personal lines insurance."
        },
        {
          "company": "RCI",
          "position": "Travel Guide",
          "period": "Previous",
          "description": "• Booked domestic and international vacations, upsold memberships and insurance products, and delivered top-tier customer service."
        },
        {
          "company": "CON SABOR A ACHIOTE",
          "position": "CEO / Founder",
          "period": "Previous",
          "description": "• Founded and operated a small food business, overseeing everything from cooking and service to marketing and supply management."
        },
        {
          "company": "AMERICAN EXPRESS",
          "position": "Financial Advisor",
          "period": "Previous",
          "description": "• Provided bilingual customer support, coached clients on financial tools, and mentored new hires while consistently achieving strong sales."
        },
        {
          "company": "COOPERATIVA DE TRANSFORMADORES",
          "position": "Business Coach",
          "period": "Previous",
          "description": "• Coached cooperatives in improving production and business strategies, including marketing and product positioning."
        },
        {
          "company": "CONSULTORÍA DE COMERCIO",
          "position": "Administrator",
          "period": "Previous",
          "description": "• Managed general business administration tasks including payroll, invoicing, collections, and Airbnb property oversight."
        },
        {
          "company": "AT&T",
          "position": "Corporate Trainer",
          "period": "Previous",
          "description": "• Led direct marketing efforts, trained new hires, and contributed to customer acquisition through sales presentations and travel-based outreach."
        },
        {
          "company": "WALT DISNEY WORLD",
          "position": "Customer Service, Sales Promoter",
          "period": "Previous",
          "description": "• Delivered exceptional customer service in merchandise and attraction operations, handling guest relations and logistics."
        }
      ],
      "discResult": "I+D",
      "discResultDescription": "Influence (I) - Charismatic and engaging. I-type VAs excel in client communication, networking, and keeping teams motivated.\\n\\nDominance (D) - Proactive and goal-driven. D-type VAs take initiative, solve problems efficiently, and thrive in fast-paced environments.",
      "englishScore": "7.4",
      "englishDescription": "Speaks with clarity and fluency, using a broad vocabulary and idiomatic expressions effectively. Pronunciation is clear and easy to understand, with confident use of grammar structures to express complex ideas.",
      "education": {
        "school": "Universidad Iberoamericana Puebla",
        "degree": "Bachelor in International Commerce",
        "date": "2010 - 2014"
      },
      "sourceFile": "SandraProfile.jsx"
    },
    {
      "name": "XIMENA G.",
      "title": "INSURANCE VIRTUAL ASSISTANT",
      "image": "/images/VAs/Ximena G.webp",
      "summary": "Ximena is an experienced Insurance Virtual Assistant with a strong background in policy servicing, client communication, and administrative support. She has extensive experience managing home and auto insurance policies. Her ability to communicate effectively with both clients and insurance carriers has allowed her to provide efficient, reliable, and customer-focused service.",
      "tagline": "Ximena is the ideal Virtual Assistant for insurance agencies and service-oriented teams seeking a detail-oriented, client-focused professional experienced in policy servicing, billing coordination, and customer communication.",
      "videoUrl": "https://www.youtube.com/embed/UQ2JcPPjEnE",
      "skills": [
        "Home & Auto Policy Management",
        "Cross-Selling & Client Retention",
        "Back-Office Support",
        "Customer Service",
        "Billing Resolution",
        "Carrier Communication",
        "Quoting on Existing Policies",
        "Payments & Cancellations",
        "Underwriting",
        "Renewals",
        "Documentation Requests"
      ],
      "tools": [
        "Microsoft Office Suite",
        "Google Workspace",
        "Insurance Carrier Platforms",
        "CRM & Communication Tools",
        "Email & Calendar Management Systems"
      ],
      "equipment": [
        "Two-Monitor Setup",
        "Noise-Cancelling Headset"
      ],
      "employmentHistory": [
        {
          "company": "OCEAN VIRTUAL ASSISTANT SOLUTIONS",
          "position": "Virtual Assistant",
          "period": "2023 - 2025",
          "description": "• Provide remote support to U.S. insurance agencies in policy management, client services, and administrative processes.\\n• Manage policies (renewals, endorsements, cancellations, billing).\\n• Offer customer service via email, phone, and text.\\n• Communicate with carriers for issue resolution.\\n• Cross-sell products and train new team members.\\n• Oversee payment processing and documentation management."
        },
        {
          "company": "QUALFON - ALLSTATE INSURANCE CAMPAIGN",
          "position": "Bilingual Customer Service Agent & Training Support",
          "period": "2021 - 2023",
          "description": "• Delivered bilingual customer service to U.S. clients for home and auto insurance policies.\\n• Assisted in training new agents and maintained service quality standards.\\n• Managed policy changes, renewals, cancellations, and billing.\\n• Coordinated with carriers to resolve client issues.\\n• Trained and mentored new agents.\\n• Cross-sold insurance products to strengthen client coverage."
        },
        {
          "company": "UNIVERSIDAD CUGS",
          "position": "Educational Advisor / Call Center",
          "period": "2018 - 2019",
          "description": "• Provided guidance to prospective students on admissions and enrollment processes.\\n• Handled calls, answered inquiries, and maintained accurate student records while ensuring excellent customer service.\\n• Supported students with academic program details and documentation.\\n• Managed inbound/outbound calls and follow-ups.\\n• Assisted in orientations and enrollment support."
        }
      ],
      "discResult": "S+C",
      "discResultDescription": "Steadiness (S) - Dependable and patient. S-type VAs provide consistent support, build strong client relationships, and ensure smooth workflows.\\n\\nConscientiousness (C) - Detail-oriented and organized. C-type VAs ensure accuracy, maintain structured systems, and deliver high-quality work.",
      "englishScore": "7.6/9",
      "englishDescription": "Speaks fluently with natural pronunciation and minimal pauses, making communication clear and engaging. Uses advanced vocabulary and complex grammar structures effectively to express nuanced ideas.",
      "education": {
        "school": "Not provided",
        "degree": "Not provided",
        "date": null
      },
      "sourceFile": "XimenaGProfile.jsx"
    }
  ]
}